{
  "INFJ-A-Aries": {
    "//": 1
  },
  "INFJ-A-Taurus": {
    "//": 2
  },
  "INFJ-A-Gemini": {
    "//": 3
  },
  "INFJ-A-Cancer": {
    "persona": "Cuddle Sorcerer",
    "intro": "Welcome to the whimsical world of the \"Cuddle Sorcerer\"—the enchanting blend of deep thinking, emotional intuition, and nurturing energy. This combo makes life and romance an adventure filled with heartfelt connections, belly laughs, and a few happy tears. Buckle up for a journey where empathy meets hilarity!",
    "superpower_highlights": [
      "Brainy Brewmasters: Solving life’s mysteries while making the perfect cup of tea—think Sherlock Holmes, but with a secret snack stash.",
      "Emotion Detectives: Sensing your mood swings faster than your phone connects to Wi-Fi. They know you’re sad before you realize the ice cream’s gone.",
      "Midnight Heroes: The friend who shows up at 3 AM with ice cream and tissues. Because sometimes you just need a shoulder and a sugar fix.",
      "Netflix Negotiators: Willing to let you pick the show... most of the time. Just don’t push it with too much reality TV.",
      "Preparedness Pros: Always ready with a phone charger, Band-Aids, and probably a spare of whatever you forgot. Basically, a walking survival kit.",
      "Memory Masters: They remember your pizza toppings and exactly how you take your coffee. They’re like a human Google Home but with more personality.",
      "Hug Ninjas: They just know when you need a hug. It’s like having a sixth sense, but for snuggles.",
      "Nostalgia Ninjas: Prepare for a barrage of nostalgic gifts and heartfelt notes that will make your gift-giving game feel weak.",
      "Loyalty Lions: Think of them as a human-sized security blanket with a keen nose for trouble.",
      "Chat Champions: Heart-to-heart talks that make you feel like the star of an indie film. “We need to talk” becomes “Let’s bond over deep convos.”"
    ],
    "love_potion_ingredients": [
      "Emotional Depth and Understanding: They read you like an open book—sometimes before you’ve even written the page. It’s like having an emotional GPS that reroutes you straight to comfort.",
      "Nurturing and Supportive Nature: Combining Cancer’s nesting instincts with Type A’s organizational skills, they’re the perfect life coach who also happens to have an endless supply of hugs.",
      "Loyalty and Commitment: When they commit, it’s like having an emotional bodyguard. They’re with you through rain, shine, and all of life’s unexpected plot twists.",
      "Thoughtful Communication: Their heart-to-heart chats make you feel like the star of a very understanding indie film. “We need to talk” transforms into “Let’s strengthen our bond.”",
      "Protectiveness: Whether it’s deflecting rude comments or ensuring you don’t catch a cold, they’ve got your back like a golden retriever with a PhD in psychology."
    ],
    "plot_twists_cliffhangers": [
      "Over-Sensitivity: Sometimes, their heart-on-sleeve approach means that minor issues can feel like a full-blown emotional earthquake. Tread gently, my friends.",
      "High Expectations: They dream big and love even bigger. Occasionally, this means expecting you to be their everything, always. No pressure.",
      "Self-Sacrifice: They give until they’re running on empty. They need to remember that self-care isn’t selfish—it’s like recharging their superpowers."
    ],
    "happily_ever_after": "The \"Cuddle Sorcerer\" in a romantic relationship is like stumbling upon a treasure chest of empathy, loyalty, and deep emotional connection. They make you feel truly seen and cherished. Just remind them to save some of that loving energy for themselves, and you’re in for a beautifully balanced, laughter-filled journey together. Enjoy the ride!"
  },
  "INFJ-A-Leo": {
    "summary": "You are INFJ with blood type A and Leo.",
    "//": 5
  },
  "INFJ-A-Virgo": {
    "summary": "You are INFJ with blood type A and Virgo.",
    "//": 6
  },
  "INFJ-A-Libra": {
    "summary": "You are INFJ with blood type A and Libra.",
    "//": 7
  },
  "INFJ-A-Scorpio": {
    "summary": "You are INFJ with blood type A and Scorpio.",
    "//": 8
  },
  "INFJ-A-Sagittarius": {
    "summary": "You are INFJ with blood type A and Sagittarius.",
    "//": 9
  },
  "INFJ-A-Capricorn": {
    "summary": "You are INFJ with blood type A and Capricorn.",
    "//": 10
  },
  "INFJ-A-Aquarius": {
    "summary": "You are INFJ with blood type A and Aquarius.",
    "//": 11
  },
  "INFJ-A-Pisces": {
    "summary": "You are INFJ with blood type A and Pisces.",
    "//": 12
  },
  "INFJ-B-Aries": {
    "summary": "You are INFJ with blood type B and Aries.",
    "//": 13
  },
  "INFJ-B-Taurus": {
    "summary": "You are INFJ with blood type B and Taurus.",
    "//": 14
  },
  "INFJ-B-Gemini": {
    "summary": "You are INFJ with blood type B and Gemini.",
    "//": 15
  },
  "INFJ-B-Cancer": {
    "summary": "You are INFJ with blood type B and Cancer.",
    "//": 16
  },
  "INFJ-B-Leo": {
    "summary": "You are INFJ with blood type B and Leo.",
    "//": 17
  },
  "INFJ-B-Virgo": {
    "summary": "You are INFJ with blood type B and Virgo.",
    "//": 18
  },
  "INFJ-B-Libra": {
    "summary": "You are INFJ with blood type B and Libra.",
    "//": 19
  },
  "INFJ-B-Scorpio": {
    "summary": "You are INFJ with blood type B and Scorpio.",
    "//": 20
  },
  "INFJ-B-Sagittarius": {
    "summary": "You are INFJ with blood type B and Sagittarius.",
    "//": 21
  },
  "INFJ-B-Capricorn": {
    "summary": "You are INFJ with blood type B and Capricorn.",
    "//": 22
  },
  "INFJ-B-Aquarius": {
    "summary": "You are INFJ with blood type B and Aquarius.",
    "//": 23
  },
  "INFJ-B-Pisces": {
    "summary": "You are INFJ with blood type B and Pisces.",
    "//": 24
  },
  "INFJ-AB-Aries": {
    "summary": "You are INFJ with blood type AB and Aries.",
    "//": 25
  },
  "INFJ-AB-Taurus": {
    "summary": "You are INFJ with blood type AB and Taurus.",
    "//": 26
  },
  "INFJ-AB-Gemini": {
    "summary": "You are INFJ with blood type AB and Gemini.",
    "//": 27
  },
  "INFJ-AB-Cancer": {
    "summary": "You are INFJ with blood type AB and Cancer.",
    "//": 28
  },
  "INFJ-AB-Leo": {
    "summary": "You are INFJ with blood type AB and Leo.",
    "//": 29
  },
  "INFJ-AB-Virgo": {
    "summary": "You are INFJ with blood type AB and Virgo.",
    "//": 30
  },
  "INFJ-AB-Libra": {
    "summary": "You are INFJ with blood type AB and Libra.",
    "//": 31
  },
  "INFJ-AB-Scorpio": {
    "summary": "You are INFJ with blood type AB and Scorpio.",
    "//": 32
  },
  "INFJ-AB-Sagittarius": {
    "summary": "You are INFJ with blood type AB and Sagittarius.",
    "//": 33
  },
  "INFJ-AB-Capricorn": {
    "summary": "You are INFJ with blood type AB and Capricorn.",
    "//": 34
  },
  "INFJ-AB-Aquarius": {
    "summary": "You are INFJ with blood type AB and Aquarius.",
    "//": 35
  },
  "INFJ-AB-Pisces": {
    "summary": "You are INFJ with blood type AB and Pisces.",
    "//": 36
  },
  "INFJ-O-Aries": {
    "summary": "You are INFJ with blood type O and Aries.",
    "//": 37
  },
  "INFJ-O-Taurus": {
    "summary": "You are INFJ with blood type O and Taurus.",
    "//": 38
  },
  "INFJ-O-Gemini": {
    "summary": "You are INFJ with blood type O and Gemini.",
    "//": 39
  },
  "INFJ-O-Cancer": {
    "summary": "You are INFJ with blood type O and Cancer.",
    "//": 40
  },
  "INFJ-O-Leo": {
    "summary": "You are INFJ with blood type O and Leo.",
    "//": 41
  },
  "INFJ-O-Virgo": {
    "summary": "You are INFJ with blood type O and Virgo.",
    "//": 42
  },
  "INFJ-O-Libra": {
    "summary": "You are INFJ with blood type O and Libra.",
    "//": 43
  },
  "INFJ-O-Scorpio": {
    "summary": "You are INFJ with blood type O and Scorpio.",
    "//": 44
  },
  "INFJ-O-Sagittarius": {
    "summary": "You are INFJ with blood type O and Sagittarius.",
    "//": 45
  },
  "INFJ-O-Capricorn": {
    "summary": "You are INFJ with blood type O and Capricorn.",
    "//": 46
  },
  "INFJ-O-Aquarius": {
    "summary": "You are INFJ with blood type O and Aquarius.",
    "//": 47
  },
  "INFJ-O-Pisces": {
    "summary": "You are INFJ with blood type O and Pisces.",
    "//": 48
  },
  "INTJ-A-Aries": {
    "summary": "You are INTJ with blood type A and Aries.",
    "//": 49
  },
  "INTJ-A-Taurus": {
    "summary": "You are INTJ with blood type A and Taurus.",
    "//": 50
  },
  "INTJ-A-Gemini": {
    "summary": "You are INTJ with blood type A and Gemini.",
    "//": 51
  },
  "INTJ-A-Cancer": {
    "summary": "You are INTJ with blood type A and Cancer.",
    "//": 52
  },
  "INTJ-A-Leo": {
    "summary": "You are INTJ with blood type A and Leo.",
    "//": 53
  },
  "INTJ-A-Virgo": {
    "summary": "You are INTJ with blood type A and Virgo.",
    "//": 54
  },
  "INTJ-A-Libra": {
    "summary": "You are INTJ with blood type A and Libra.",
    "//": 55
  },
  "INTJ-A-Scorpio": {
    "summary": "You are INTJ with blood type A and Scorpio.",
    "//": 56
  },
  "INTJ-A-Sagittarius": {
    "summary": "You are INTJ with blood type A and Sagittarius.",
    "//": 57
  },
  "INTJ-A-Capricorn": {
    "summary": "You are INTJ with blood type A and Capricorn.",
    "//": 58
  },
  "INTJ-A-Aquarius": {
    "summary": "You are INTJ with blood type A and Aquarius.",
    "//": 59
  },
  "INTJ-A-Pisces": {
    "summary": "You are INTJ with blood type A and Pisces.",
    "//": 60
  },
  "INTJ-B-Aries": {
    "summary": "You are INTJ with blood type B and Aries.",
    "//": 61
  },
  "INTJ-B-Taurus": {
    "summary": "You are INTJ with blood type B and Taurus.",
    "//": 62
  },
  "INTJ-B-Gemini": {
    "summary": "You are INTJ with blood type B and Gemini.",
    "//": 63
  },
  "INTJ-B-Cancer": {
    "summary": "You are INTJ with blood type B and Cancer.",
    "//": 64
  },
  "INTJ-B-Leo": {
    "summary": "You are INTJ with blood type B and Leo.",
    "//": 65
  },
  "INTJ-B-Virgo": {
    "summary": "You are INTJ with blood type B and Virgo.",
    "//": 66
  },
  "INTJ-B-Libra": {
    "summary": "You are INTJ with blood type B and Libra.",
    "//": 67
  },
  "INTJ-B-Scorpio": {
    "summary": "You are INTJ with blood type B and Scorpio.",
    "//": 68
  },
  "INTJ-B-Sagittarius": {
    "summary": "You are INTJ with blood type B and Sagittarius.",
    "//": 69
  },
  "INTJ-B-Capricorn": {
    "summary": "You are INTJ with blood type B and Capricorn.",
    "//": 70
  },
  "INTJ-B-Aquarius": {
    "summary": "You are INTJ with blood type B and Aquarius.",
    "//": 71
  },
  "INTJ-B-Pisces": {
    "summary": "You are INTJ with blood type B and Pisces.",
    "//": 72
  },
  "INTJ-AB-Aries": {
    "summary": "You are INTJ with blood type AB and Aries.",
    "//": 73
  },
  "INTJ-AB-Taurus": {
    "summary": "You are INTJ with blood type AB and Taurus.",
    "//": 74
  },
  "INTJ-AB-Gemini": {
    "summary": "You are INTJ with blood type AB and Gemini.",
    "//": 75
  },
  "INTJ-AB-Cancer": {
    "summary": "You are INTJ with blood type AB and Cancer.",
    "//": 76
  },
  "INTJ-AB-Leo": {
    "summary": "You are INTJ with blood type AB and Leo.",
    "//": 77
  },
  "INTJ-AB-Virgo": {
    "summary": "You are INTJ with blood type AB and Virgo.",
    "//": 78
  },
  "INTJ-AB-Libra": {
    "summary": "You are INTJ with blood type AB and Libra.",
    "//": 79
  },
  "INTJ-AB-Scorpio": {
    "summary": "You are INTJ with blood type AB and Scorpio.",
    "//": 80
  },
  "INTJ-AB-Sagittarius": {
    "summary": "You are INTJ with blood type AB and Sagittarius.",
    "//": 81
  },
  "INTJ-AB-Capricorn": {
    "summary": "You are INTJ with blood type AB and Capricorn.",
    "//": 82
  },
  "INTJ-AB-Aquarius": {
    "summary": "You are INTJ with blood type AB and Aquarius.",
    "//": 83
  },
  "INTJ-AB-Pisces": {
    "summary": "You are INTJ with blood type AB and Pisces.",
    "//": 84
  },
  "INTJ-O-Aries": {
    "summary": "You are INTJ with blood type O and Aries.",
    "//": 85
  },
  "INTJ-O-Taurus": {
    "summary": "You are INTJ with blood type O and Taurus.",
    "//": 86
  },
  "INTJ-O-Gemini": {
    "summary": "You are INTJ with blood type O and Gemini.",
    "//": 87
  },
  "INTJ-O-Cancer": {
    "summary": "You are INTJ with blood type O and Cancer.",
    "//": 88
  },
  "INTJ-O-Leo": {
    "summary": "You are INTJ with blood type O and Leo.",
    "//": 89
  },
  "INTJ-O-Virgo": {
    "summary": "You are INTJ with blood type O and Virgo.",
    "//": 90
  },
  "INTJ-O-Libra": {
    "summary": "You are INTJ with blood type O and Libra.",
    "//": 91
  },
  "INTJ-O-Scorpio": {
    "summary": "You are INTJ with blood type O and Scorpio.",
    "//": 92
  },
  "INTJ-O-Sagittarius": {
    "summary": "You are INTJ with blood type O and Sagittarius.",
    "//": 93
  },
  "INTJ-O-Capricorn": {
    "summary": "You are INTJ with blood type O and Capricorn.",
    "//": 94
  },
  "INTJ-O-Aquarius": {
    "summary": "You are INTJ with blood type O and Aquarius.",
    "//": 95
  },
  "INTJ-O-Pisces": {
    "summary": "You are INTJ with blood type O and Pisces.",
    "//": 96
  },
  "INFP-A-Aries": {
    "summary": "You are INFP with blood type A and Aries.",
    "//": 97
  },
  "INFP-A-Taurus": {
    "summary": "You are INFP with blood type A and Taurus.",
    "//": 98
  },
  "INFP-A-Gemini": {
    "summary": "You are INFP with blood type A and Gemini.",
    "//": 99
  },
  "INFP-A-Cancer": {
    "summary": "You are INFP with blood type A and Cancer.",
    "//": 100
  },
  "INFP-A-Leo": {
    "summary": "You are INFP with blood type A and Leo.",
    "//": 101
  },
  "INFP-A-Virgo": {
    "summary": "You are INFP with blood type A and Virgo.",
    "//": 102
  },
  "INFP-A-Libra": {
    "summary": "You are INFP with blood type A and Libra.",
    "//": 103
  },
  "INFP-A-Scorpio": {
    "summary": "You are INFP with blood type A and Scorpio.",
    "//": 104
  },
  "INFP-A-Sagittarius": {
    "summary": "You are INFP with blood type A and Sagittarius.",
    "//": 105
  },
  "INFP-A-Capricorn": {
    "summary": "You are INFP with blood type A and Capricorn.",
    "//": 106
  },
  "INFP-A-Aquarius": {
    "summary": "You are INFP with blood type A and Aquarius.",
    "//": 107
  },
  "INFP-A-Pisces": {
    "summary": "You are INFP with blood type A and Pisces.",
    "//": 108
  },
  "INFP-B-Aries": {
    "summary": "You are INFP with blood type B and Aries.",
    "//": 109
  },
  "INFP-B-Taurus": {
    "summary": "You are INFP with blood type B and Taurus.",
    "//": 110
  },
  "INFP-B-Gemini": {
    "summary": "You are INFP with blood type B and Gemini.",
    "//": 111
  },
  "INFP-B-Cancer": {
    "summary": "You are INFP with blood type B and Cancer.",
    "//": 112
  },
  "INFP-B-Leo": {
    "summary": "You are INFP with blood type B and Leo.",
    "//": 113
  },
  "INFP-B-Virgo": {
    "summary": "You are INFP with blood type B and Virgo.",
    "//": 114
  },
  "INFP-B-Libra": {
    "summary": "You are INFP with blood type B and Libra.",
    "//": 115
  },
  "INFP-B-Scorpio": {
    "summary": "You are INFP with blood type B and Scorpio.",
    "//": 116
  },
  "INFP-B-Sagittarius": {
    "summary": "You are INFP with blood type B and Sagittarius.",
    "//": 117
  },
  "INFP-B-Capricorn": {
    "summary": "You are INFP with blood type B and Capricorn.",
    "//": 118
  },
  "INFP-B-Aquarius": {
    "summary": "You are INFP with blood type B and Aquarius.",
    "//": 119
  },
  "INFP-B-Pisces": {
    "summary": "You are INFP with blood type B and Pisces.",
    "//": 120
  },
  "INFP-AB-Aries": {
    "summary": "You are INFP with blood type AB and Aries.",
    "//": 121
  },
  "INFP-AB-Taurus": {
    "summary": "You are INFP with blood type AB and Taurus.",
    "//": 122
  },
  "INFP-AB-Gemini": {
    "summary": "You are INFP with blood type AB and Gemini.",
    "//": 123
  },
  "INFP-AB-Cancer": {
    "summary": "You are INFP with blood type AB and Cancer.",
    "//": 124
  },
  "INFP-AB-Leo": {
    "summary": "You are INFP with blood type AB and Leo.",
    "//": 125
  },
  "INFP-AB-Virgo": {
    "summary": "You are INFP with blood type AB and Virgo.",
    "//": 126
  },
  "INFP-AB-Libra": {
    "summary": "You are INFP with blood type AB and Libra.",
    "//": 127
  },
  "INFP-AB-Scorpio": {
    "summary": "You are INFP with blood type AB and Scorpio.",
    "//": 128
  },
  "INFP-AB-Sagittarius": {
    "summary": "You are INFP with blood type AB and Sagittarius.",
    "//": 129
  },
  "INFP-AB-Capricorn": {
    "summary": "You are INFP with blood type AB and Capricorn.",
    "//": 130
  },
  "INFP-AB-Aquarius": {
    "summary": "You are INFP with blood type AB and Aquarius.",
    "//": 131
  },
  "INFP-AB-Pisces": {
    "summary": "You are INFP with blood type AB and Pisces.",
    "//": 132
  },
  "INFP-O-Aries": {
    "summary": "You are INFP with blood type O and Aries.",
    "//": 133
  },
  "INFP-O-Taurus": {
    "summary": "You are INFP with blood type O and Taurus.",
    "//": 134
  },
  "INFP-O-Gemini": {
    "summary": "You are INFP with blood type O and Gemini.",
    "//": 135
  },
  "INFP-O-Cancer": {
    "summary": "You are INFP with blood type O and Cancer.",
    "//": 136
  },
  "INFP-O-Leo": {
    "summary": "You are INFP with blood type O and Leo.",
    "//": 137
  },
  "INFP-O-Virgo": {
    "summary": "You are INFP with blood type O and Virgo.",
    "//": 138
  },
  "INFP-O-Libra": {
    "summary": "You are INFP with blood type O and Libra.",
    "//": 139
  },
  "INFP-O-Scorpio": {
    "summary": "You are INFP with blood type O and Scorpio.",
    "//": 140
  },
  "INFP-O-Sagittarius": {
    "summary": "You are INFP with blood type O and Sagittarius.",
    "//": 141
  },
  "INFP-O-Capricorn": {
    "summary": "You are INFP with blood type O and Capricorn.",
    "//": 142
  },
  "INFP-O-Aquarius": {
    "summary": "You are INFP with blood type O and Aquarius.",
    "//": 143
  },
  "INFP-O-Pisces": {
    "summary": "You are INFP with blood type O and Pisces.",
    "//": 144
  },
  "INTP-A-Aries": {
    "summary": "You are INTP with blood type A and Aries.",
    "//": 145
  },
  "INTP-A-Taurus": {
    "summary": "You are INTP with blood type A and Taurus.",
    "//": 146
  },
  "INTP-A-Gemini": {
    "summary": "You are INTP with blood type A and Gemini.",
    "//": 147
  },
  "INTP-A-Cancer": {
    "summary": "You are INTP with blood type A and Cancer.",
    "//": 148
  },
  "INTP-A-Leo": {
    "summary": "You are INTP with blood type A and Leo.",
    "//": 149
  },
  "INTP-A-Virgo": {
    "summary": "You are INTP with blood type A and Virgo.",
    "//": 150
  },
  "INTP-A-Libra": {
    "summary": "You are INTP with blood type A and Libra.",
    "//": 151
  },
  "INTP-A-Scorpio": {
    "summary": "You are INTP with blood type A and Scorpio.",
    "//": 152
  },
  "INTP-A-Sagittarius": {
    "summary": "You are INTP with blood type A and Sagittarius.",
    "//": 153
  },
  "INTP-A-Capricorn": {
    "summary": "You are INTP with blood type A and Capricorn.",
    "//": 154
  },
  "INTP-A-Aquarius": {
    "summary": "You are INTP with blood type A and Aquarius.",
    "//": 155
  },
  "INTP-A-Pisces": {
    "summary": "You are INTP with blood type A and Pisces.",
    "//": 156
  },
  "INTP-B-Aries": {
    "summary": "You are INTP with blood type B and Aries.",
    "//": 157
  },
  "INTP-B-Taurus": {
    "summary": "You are INTP with blood type B and Taurus.",
    "//": 158
  },
  "INTP-B-Gemini": {
    "summary": "You are INTP with blood type B and Gemini.",
    "//": 159
  },
  "INTP-B-Cancer": {
    "summary": "You are INTP with blood type B and Cancer.",
    "//": 160
  },
  "INTP-B-Leo": {
    "summary": "You are INTP with blood type B and Leo.",
    "//": 161
  },
  "INTP-B-Virgo": {
    "summary": "You are INTP with blood type B and Virgo.",
    "//": 162
  },
  "INTP-B-Libra": {
    "summary": "You are INTP with blood type B and Libra.",
    "//": 163
  },
  "INTP-B-Scorpio": {
    "summary": "You are INTP with blood type B and Scorpio.",
    "//": 164
  },
  "INTP-B-Sagittarius": {
    "summary": "You are INTP with blood type B and Sagittarius.",
    "//": 165
  },
  "INTP-B-Capricorn": {
    "summary": "You are INTP with blood type B and Capricorn.",
    "//": 166
  },
  "INTP-B-Aquarius": {
    "summary": "You are INTP with blood type B and Aquarius.",
    "//": 167
  },
  "INTP-B-Pisces": {
    "summary": "You are INTP with blood type B and Pisces.",
    "//": 168
  },
  "INTP-AB-Aries": {
    "summary": "You are INTP with blood type AB and Aries.",
    "//": 169
  },
  "INTP-AB-Taurus": {
    "summary": "You are INTP with blood type AB and Taurus.",
    "//": 170
  },
  "INTP-AB-Gemini": {
    "summary": "You are INTP with blood type AB and Gemini.",
    "//": 171
  },
  "INTP-AB-Cancer": {
    "summary": "You are INTP with blood type AB and Cancer.",
    "//": 172
  },
  "INTP-AB-Leo": {
    "summary": "You are INTP with blood type AB and Leo.",
    "//": 173
  },
  "INTP-AB-Virgo": {
    "summary": "You are INTP with blood type AB and Virgo.",
    "//": 174
  },
  "INTP-AB-Libra": {
    "summary": "You are INTP with blood type AB and Libra.",
    "//": 175
  },
  "INTP-AB-Scorpio": {
    "summary": "You are INTP with blood type AB and Scorpio.",
    "//": 176
  },
  "INTP-AB-Sagittarius": {
    "summary": "You are INTP with blood type AB and Sagittarius.",
    "//": 177
  },
  "INTP-AB-Capricorn": {
    "summary": "You are INTP with blood type AB and Capricorn.",
    "//": 178
  },
  "INTP-AB-Aquarius": {
    "summary": "You are INTP with blood type AB and Aquarius.",
    "//": 179
  },
  "INTP-AB-Pisces": {
    "summary": "You are INTP with blood type AB and Pisces.",
    "//": 180
  },
  "INTP-O-Aries": {
    "summary": "You are INTP with blood type O and Aries.",
    "//": 181
  },
  "INTP-O-Taurus": {
    "summary": "You are INTP with blood type O and Taurus.",
    "//": 182
  },
  "INTP-O-Gemini": {
    "summary": "You are INTP with blood type O and Gemini.",
    "//": 183
  },
  "INTP-O-Cancer": {
    "summary": "You are INTP with blood type O and Cancer.",
    "//": 184
  },
  "INTP-O-Leo": {
    "summary": "You are INTP with blood type O and Leo.",
    "//": 185
  },
  "INTP-O-Virgo": {
    "summary": "You are INTP with blood type O and Virgo.",
    "//": 186
  },
  "INTP-O-Libra": {
    "summary": "You are INTP with blood type O and Libra.",
    "//": 187
  },
  "INTP-O-Scorpio": {
    "summary": "You are INTP with blood type O and Scorpio.",
    "//": 188
  },
  "INTP-O-Sagittarius": {
    "summary": "You are INTP with blood type O and Sagittarius.",
    "//": 189
  },
  "INTP-O-Capricorn": {
    "summary": "You are INTP with blood type O and Capricorn.",
    "//": 190
  },
  "INTP-O-Aquarius": {
    "summary": "You are INTP with blood type O and Aquarius.",
    "//": 191
  },
  "INTP-O-Pisces": {
    "summary": "You are INTP with blood type O and Pisces.",
    "//": 192
  },
  "ISTJ-A-Aries": {
    "summary": "You are ISTJ with blood type A and Aries.",
    "//": 193
  },
  "ISTJ-A-Taurus": {
    "summary": "You are ISTJ with blood type A and Taurus.",
    "//": 194
  },
  "ISTJ-A-Gemini": {
    "summary": "You are ISTJ with blood type A and Gemini.",
    "//": 195
  },
  "ISTJ-A-Cancer": {
    "summary": "You are ISTJ with blood type A and Cancer.",
    "//": 196
  },
  "ISTJ-A-Leo": {
    "summary": "You are ISTJ with blood type A and Leo.",
    "//": 197
  },
  "ISTJ-A-Virgo": {
    "summary": "You are ISTJ with blood type A and Virgo.",
    "//": 198
  },
  "ISTJ-A-Libra": {
    "summary": "You are ISTJ with blood type A and Libra.",
    "//": 199
  },
  "ISTJ-A-Scorpio": {
    "summary": "You are ISTJ with blood type A and Scorpio.",
    "//": 200
  },
  "ISTJ-A-Sagittarius": {
    "summary": "You are ISTJ with blood type A and Sagittarius.",
    "//": 201
  },
  "ISTJ-A-Capricorn": {
    "summary": "You are ISTJ with blood type A and Capricorn.",
    "//": 202
  },
  "ISTJ-A-Aquarius": {
    "summary": "You are ISTJ with blood type A and Aquarius.",
    "//": 203
  },
  "ISTJ-A-Pisces": {
    "summary": "You are ISTJ with blood type A and Pisces.",
    "//": 204
  },
  "ISTJ-B-Aries": {
    "summary": "You are ISTJ with blood type B and Aries.",
    "//": 205
  },
  "ISTJ-B-Taurus": {
    "summary": "You are ISTJ with blood type B and Taurus.",
    "//": 206
  },
  "ISTJ-B-Gemini": {
    "summary": "You are ISTJ with blood type B and Gemini.",
    "//": 207
  },
  "ISTJ-B-Cancer": {
    "summary": "You are ISTJ with blood type B and Cancer.",
    "//": 208
  },
  "ISTJ-B-Leo": {
    "summary": "You are ISTJ with blood type B and Leo.",
    "//": 209
  },
  "ISTJ-B-Virgo": {
    "summary": "You are ISTJ with blood type B and Virgo.",
    "//": 210
  },
  "ISTJ-B-Libra": {
    "summary": "You are ISTJ with blood type B and Libra.",
    "//": 211
  },
  "ISTJ-B-Scorpio": {
    "summary": "You are ISTJ with blood type B and Scorpio.",
    "//": 212
  },
  "ISTJ-B-Sagittarius": {
    "summary": "You are ISTJ with blood type B and Sagittarius.",
    "//": 213
  },
  "ISTJ-B-Capricorn": {
    "summary": "You are ISTJ with blood type B and Capricorn.",
    "//": 214
  },
  "ISTJ-B-Aquarius": {
    "summary": "You are ISTJ with blood type B and Aquarius.",
    "//": 215
  },
  "ISTJ-B-Pisces": {
    "summary": "You are ISTJ with blood type B and Pisces.",
    "//": 216
  },
  "ISTJ-AB-Aries": {
    "summary": "You are ISTJ with blood type AB and Aries.",
    "//": 217
  },
  "ISTJ-AB-Taurus": {
    "summary": "You are ISTJ with blood type AB and Taurus.",
    "//": 218
  },
  "ISTJ-AB-Gemini": {
    "summary": "You are ISTJ with blood type AB and Gemini.",
    "//": 219
  },
  "ISTJ-AB-Cancer": {
    "summary": "You are ISTJ with blood type AB and Cancer.",
    "//": 220
  },
  "ISTJ-AB-Leo": {
    "summary": "You are ISTJ with blood type AB and Leo.",
    "//": 221
  },
  "ISTJ-AB-Virgo": {
    "summary": "You are ISTJ with blood type AB and Virgo.",
    "//": 222
  },
  "ISTJ-AB-Libra": {
    "summary": "You are ISTJ with blood type AB and Libra.",
    "//": 223
  },
  "ISTJ-AB-Scorpio": {
    "summary": "You are ISTJ with blood type AB and Scorpio.",
    "//": 224
  },
  "ISTJ-AB-Sagittarius": {
    "summary": "You are ISTJ with blood type AB and Sagittarius.",
    "//": 225
  },
  "ISTJ-AB-Capricorn": {
    "summary": "You are ISTJ with blood type AB and Capricorn.",
    "//": 226
  },
  "ISTJ-AB-Aquarius": {
    "summary": "You are ISTJ with blood type AB and Aquarius.",
    "//": 227
  },
  "ISTJ-AB-Pisces": {
    "summary": "You are ISTJ with blood type AB and Pisces.",
    "//": 228
  },
  "ISTJ-O-Aries": {
    "summary": "You are ISTJ with blood type O and Aries.",
    "//": 229
  },
  "ISTJ-O-Taurus": {
    "summary": "You are ISTJ with blood type O and Taurus.",
    "//": 230
  },
  "ISTJ-O-Gemini": {
    "summary": "You are ISTJ with blood type O and Gemini.",
    "//": 231
  },
  "ISTJ-O-Cancer": {
    "summary": "You are ISTJ with blood type O and Cancer. Practical Nurturer\n\nOverview:\nMeet the 'Practical Nurturer'—a solid rock of reliability with a heart as soft as a marshmallow. This blend of traits makes for a loyal and dependable partner who’s all about making sure everything runs smoothly and everyone feels loved.\n\nKey Traits:\n\n1. ISTJ (Introverted, Sensing, Thinking, Judging):\n\n- Reliable: The human embodiment of a Swiss watch—always on time and dependable.\n- Detail-oriented: They notice the little things, like when you’re down or need a pick-me-up.\n- Logical: They can solve problems with the precision of a seasoned detective.\n\n2. Blood Type O:\n\n- Confident: They tackle challenges head-on and rarely back down from a task.\n- Ambitious: They’re driven to succeed and will work tirelessly to achieve their goals.\n- Practical: They have a no-nonsense approach to life and relationships.\n\n3. Cancer (Zodiac Sign):\n\n- Intuitive: They have a sixth sense for knowing when you need comfort.\n- Sentimental: They cherish memories and love creating special moments.\n- Loyal and protective: They’re fiercely devoted and will always stand by your side.\n\nManifestation in Romantic Relationships:\n\n1. Reliable Support:\n\n- The 'Practical Nurturer' is the partner who always shows up. Whether it’s fixing a leaky faucet or providing a listening ear, they’re your go-to person.\n\n2. Nurturing Stability:\n\n- They combine Cancer’s nurturing nature with ISTJ’s practical mindset to create a home that’s both warm and well-organized. Think cozy evenings with everything in its place.\n\n3. Loyal Commitment:\n\n- Their loyalty runs deep. Once they commit, they’re in it for the long haul, ensuring a stable and secure relationship.\n\n4. Thoughtful Actions:\n\n- Expect practical gestures of love, like remembering to pick up your favorite snack or ensuring your car is always running smoothly. They show love through actions more than words.\n\n5. Protective Instincts:\n\n- They’re like a protective shield, always looking out for your well-being and making sure you’re safe and sound.\n\nPotential Challenges:\n\n1. Rigidity:\n\n- Their love for routine and structure can sometimes make them inflexible. Spontaneity isn’t their strong suit, so surprises might not always go over well.\n\n2. Emotional Reserve:\n\n- They might struggle to express their emotions verbally. Their feelings run deep, but they prefer to show them through actions rather than words.\n\n3. High Standards:\n\n- They have high expectations for themselves and their partners. This can lead to pressure to meet their standards, which might sometimes feel overwhelming.\n\nConclusion:\n\nThe 'Practical Nurturer' in a romantic relationship brings a blend of reliability, loyalty, and practical love. They’re the partner who makes you feel secure and cherished through their steadfast presence and thoughtful actions. Just make sure to appreciate their efforts and occasionally push them out of their comfort zone for a spontaneous adventure, and you’ll enjoy a wonderfully balanced and loving relationship.",
    "//": 232
  },
  "ISTJ-O-Leo": {
    "summary": "You are ISTJ with blood type O and Leo.",
    "//": 233
  },
  "ISTJ-O-Virgo": {
    "summary": "You are ISTJ with blood type O and Virgo.",
    "//": 234
  },
  "ISTJ-O-Libra": {
    "summary": "You are ISTJ with blood type O and Libra.",
    "//": 235
  },
  "ISTJ-O-Scorpio": {
    "summary": "You are ISTJ with blood type O and Scorpio.",
    "//": 236
  },
  "ISTJ-O-Sagittarius": {
    "summary": "You are ISTJ with blood type O and Sagittarius.",
    "//": 237
  },
  "ISTJ-O-Capricorn": {
    "summary": "You are ISTJ with blood type O and Capricorn.",
    "//": 238
  },
  "ISTJ-O-Aquarius": {
    "summary": "You are ISTJ with blood type O and Aquarius.",
    "//": 239
  },
  "ISTJ-O-Pisces": {
    "summary": "You are ISTJ with blood type O and Pisces.",
    "//": 240
  },
  "ISTP-A-Aries": {
    "summary": "You are ISTP with blood type A and Aries.",
    "//": 241
  },
  "ISTP-A-Taurus": {
    "summary": "You are ISTP with blood type A and Taurus.",
    "//": 242
  },
  "ISTP-A-Gemini": {
    "summary": "You are ISTP with blood type A and Gemini.",
    "//": 243
  },
  "ISTP-A-Cancer": {
    "summary": "You are ISTP with blood type A and Cancer.",
    "//": 244
  },
  "ISTP-A-Leo": {
    "summary": "You are ISTP with blood type A and Leo.",
    "//": 245
  },
  "ISTP-A-Virgo": {
    "summary": "You are ISTP with blood type A and Virgo.",
    "//": 246
  },
  "ISTP-A-Libra": {
    "summary": "You are ISTP with blood type A and Libra.",
    "//": 247
  },
  "ISTP-A-Scorpio": {
    "summary": "You are ISTP with blood type A and Scorpio.",
    "//": 248
  },
  "ISTP-A-Sagittarius": {
    "summary": "You are ISTP with blood type A and Sagittarius.",
    "//": 249
  },
  "ISTP-A-Capricorn": {
    "summary": "You are ISTP with blood type A and Capricorn.",
    "//": 250
  },
  "ISTP-A-Aquarius": {
    "summary": "You are ISTP with blood type A and Aquarius.",
    "//": 251
  },
  "ISTP-A-Pisces": {
    "summary": "You are ISTP with blood type A and Pisces.",
    "//": 252
  },
  "ISTP-B-Aries": {
    "summary": "You are ISTP with blood type B and Aries.",
    "//": 253
  },
  "ISTP-B-Taurus": {
    "summary": "You are ISTP with blood type B and Taurus.",
    "//": 254
  },
  "ISTP-B-Gemini": {
    "summary": "You are ISTP with blood type B and Gemini.",
    "//": 255
  },
  "ISTP-B-Cancer": {
    "summary": "You are ISTP with blood type B and Cancer.",
    "//": 256
  },
  "ISTP-B-Leo": {
    "summary": "You are ISTP with blood type B and Leo.",
    "//": 257
  },
  "ISTP-B-Virgo": {
    "summary": "You are ISTP with blood type B and Virgo.",
    "//": 258
  },
  "ISTP-B-Libra": {
    "summary": "You are ISTP with blood type B and Libra.",
    "//": 259
  },
  "ISTP-B-Scorpio": {
    "summary": "You are ISTP with blood type B and Scorpio.",
    "//": 260
  },
  "ISTP-B-Sagittarius": {
    "summary": "You are ISTP with blood type B and Sagittarius.",
    "//": 261
  },
  "ISTP-B-Capricorn": {
    "summary": "You are ISTP with blood type B and Capricorn.",
    "//": 262
  },
  "ISTP-B-Aquarius": {
    "summary": "You are ISTP with blood type B and Aquarius.",
    "//": 263
  },
  "ISTP-B-Pisces": {
    "summary": "You are ISTP with blood type B and Pisces.",
    "//": 264
  },
  "ISTP-AB-Aries": {
    "summary": "You are ISTP with blood type AB and Aries.",
    "//": 265
  },
  "ISTP-AB-Taurus": {
    "summary": "You are ISTP with blood type AB and Taurus.",
    "//": 266
  },
  "ISTP-AB-Gemini": {
    "summary": "You are ISTP with blood type AB and Gemini.",
    "//": 267
  },
  "ISTP-AB-Cancer": {
    "summary": "You are ISTP with blood type AB and Cancer.",
    "//": 268
  },
  "ISTP-AB-Leo": {
    "summary": "You are ISTP with blood type AB and Leo.",
    "//": 269
  },
  "ISTP-AB-Virgo": {
    "summary": "You are ISTP with blood type AB and Virgo.",
    "//": 270
  },
  "ISTP-AB-Libra": {
    "summary": "You are ISTP with blood type AB and Libra.",
    "//": 271
  },
  "ISTP-AB-Scorpio": {
    "summary": "You are ISTP with blood type AB and Scorpio.",
    "//": 272
  },
  "ISTP-AB-Sagittarius": {
    "summary": "You are ISTP with blood type AB and Sagittarius.",
    "//": 273
  },
  "ISTP-AB-Capricorn": {
    "summary": "You are ISTP with blood type AB and Capricorn.",
    "//": 274
  },
  "ISTP-AB-Aquarius": {
    "summary": "You are ISTP with blood type AB and Aquarius.",
    "//": 275
  },
  "ISTP-AB-Pisces": {
    "summary": "You are ISTP with blood type AB and Pisces.",
    "//": 276
  },
  "ISTP-O-Aries": {
    "summary": "You are ISTP with blood type O and Aries.",
    "//": 277
  },
  "ISTP-O-Taurus": {
    "summary": "You are ISTP with blood type O and Taurus.",
    "//": 278
  },
  "ISTP-O-Gemini": {
    "summary": "You are ISTP with blood type O and Gemini.",
    "//": 279
  },
  "ISTP-O-Cancer": {
    "summary": "You are ISTP with blood type O and Cancer.",
    "//": 280
  },
  "ISTP-O-Leo": {
    "summary": "You are ISTP with blood type O and Leo.",
    "//": 281
  },
  "ISTP-O-Virgo": {
    "summary": "You are ISTP with blood type O and Virgo.",
    "//": 282
  },
  "ISTP-O-Libra": {
    "summary": "You are ISTP with blood type O and Libra.",
    "//": 283
  },
  "ISTP-O-Scorpio": {
    "summary": "You are ISTP with blood type O and Scorpio.",
    "//": 284
  },
  "ISTP-O-Sagittarius": {
    "summary": "You are ISTP with blood type O and Sagittarius.",
    "//": 285
  },
  "ISTP-O-Capricorn": {
    "summary": "You are ISTP with blood type O and Capricorn.",
    "//": 286
  },
  "ISTP-O-Aquarius": {
    "summary": "You are ISTP with blood type O and Aquarius.",
    "//": 287
  },
  "ISTP-O-Pisces": {
    "summary": "You are ISTP with blood type O and Pisces.",
    "//": 288
  },
  "ISFJ-A-Aries": {
    "summary": "You are ISFJ with blood type A and Aries.",
    "//": 289
  },
  "ISFJ-A-Taurus": {
    "summary": "You are ISFJ with blood type A and Taurus.",
    "//": 290
  },
  "ISFJ-A-Gemini": {
    "summary": "You are ISFJ with blood type A and Gemini.",
    "//": 291
  },
  "ISFJ-A-Cancer": {
    "summary": "You are ISFJ with blood type A and Cancer.",
    "//": 292
  },
  "ISFJ-A-Leo": {
    "summary": "You are ISFJ with blood type A and Leo.",
    "//": 293
  },
  "ISFJ-A-Virgo": {
    "summary": "You are ISFJ with blood type A and Virgo.",
    "//": 294
  },
  "ISFJ-A-Libra": {
    "summary": "You are ISFJ with blood type A and Libra.",
    "//": 295
  },
  "ISFJ-A-Scorpio": {
    "summary": "You are ISFJ with blood type A and Scorpio.",
    "//": 296
  },
  "ISFJ-A-Sagittarius": {
    "summary": "You are ISFJ with blood type A and Sagittarius.",
    "//": 297
  },
  "ISFJ-A-Capricorn": {
    "summary": "You are ISFJ with blood type A and Capricorn.",
    "//": 298
  },
  "ISFJ-A-Aquarius": {
    "summary": "You are ISFJ with blood type A and Aquarius.",
    "//": 299
  },
  "ISFJ-A-Pisces": {
    "summary": "You are ISFJ with blood type A and Pisces.",
    "//": 300
  },
  "ISFJ-B-Aries": {
    "summary": "You are ISFJ with blood type B and Aries.",
    "//": 301
  },
  "ISFJ-B-Taurus": {
    "summary": "You are ISFJ with blood type B and Taurus.",
    "//": 302
  },
  "ISFJ-B-Gemini": {
    "summary": "You are ISFJ with blood type B and Gemini.",
    "//": 303
  },
  "ISFJ-B-Cancer": {
    "summary": "You are ISFJ with blood type B and Cancer.",
    "//": 304
  },
  "ISFJ-B-Leo": {
    "summary": "You are ISFJ with blood type B and Leo.",
    "//": 305
  },
  "ISFJ-B-Virgo": {
    "summary": "You are ISFJ with blood type B and Virgo.",
    "//": 306
  },
  "ISFJ-B-Libra": {
    "summary": "You are ISFJ with blood type B and Libra.",
    "//": 307
  },
  "ISFJ-B-Scorpio": {
    "summary": "You are ISFJ with blood type B and Scorpio.",
    "//": 308
  },
  "ISFJ-B-Sagittarius": {
    "summary": "You are ISFJ with blood type B and Sagittarius.",
    "//": 309
  },
  "ISFJ-B-Capricorn": {
    "summary": "You are ISFJ with blood type B and Capricorn.",
    "//": 310
  },
  "ISFJ-B-Aquarius": {
    "summary": "You are ISFJ with blood type B and Aquarius.",
    "//": 311
  },
  "ISFJ-B-Pisces": {
    "summary": "You are ISFJ with blood type B and Pisces.",
    "//": 312
  },
  "ISFJ-AB-Aries": {
    "summary": "You are ISFJ with blood type AB and Aries.",
    "//": 313
  },
  "ISFJ-AB-Taurus": {
    "summary": "You are ISFJ with blood type AB and Taurus.",
    "//": 314
  },
  "ISFJ-AB-Gemini": {
    "summary": "You are ISFJ with blood type AB and Gemini.",
    "//": 315
  },
  "ISFJ-AB-Cancer": {
    "summary": "You are ISFJ with blood type AB and Cancer.",
    "//": 316
  },
  "ISFJ-AB-Leo": {
    "summary": "You are ISFJ with blood type AB and Leo.",
    "//": 317
  },
  "ISFJ-AB-Virgo": {
    "summary": "You are ISFJ with blood type AB and Virgo.",
    "//": 318
  },
  "ISFJ-AB-Libra": {
    "summary": "You are ISFJ with blood type AB and Libra.",
    "//": 319
  },
  "ISFJ-AB-Scorpio": {
    "summary": "You are ISFJ with blood type AB and Scorpio.",
    "//": 320
  },
  "ISFJ-AB-Sagittarius": {
    "summary": "You are ISFJ with blood type AB and Sagittarius.",
    "//": 321
  },
  "ISFJ-AB-Capricorn": {
    "summary": "You are ISFJ with blood type AB and Capricorn.",
    "//": 322
  },
  "ISFJ-AB-Aquarius": {
    "summary": "You are ISFJ with blood type AB and Aquarius.",
    "//": 323
  },
  "ISFJ-AB-Pisces": {
    "summary": "You are ISFJ with blood type AB and Pisces.",
    "//": 324
  },
  "ISFJ-O-Aries": {
    "summary": "You are ISFJ with blood type O and Aries.",
    "//": 325
  },
  "ISFJ-O-Taurus": {
    "summary": "You are ISFJ with blood type O and Taurus.",
    "//": 326
  },
  "ISFJ-O-Gemini": {
    "summary": "You are ISFJ with blood type O and Gemini.",
    "//": 327
  },
  "ISFJ-O-Cancer": {
    "summary": "You are ISFJ with blood type O and Cancer.",
    "//": 328
  },
  "ISFJ-O-Leo": {
    "summary": "You are ISFJ with blood type O and Leo.",
    "//": 329
  },
  "ISFJ-O-Virgo": {
    "summary": "You are ISFJ with blood type O and Virgo.",
    "//": 330
  },
  "ISFJ-O-Libra": {
    "summary": "You are ISFJ with blood type O and Libra.",
    "//": 331
  },
  "ISFJ-O-Scorpio": {
    "summary": "You are ISFJ with blood type O and Scorpio.",
    "//": 332
  },
  "ISFJ-O-Sagittarius": {
    "summary": "You are ISFJ with blood type O and Sagittarius.",
    "//": 333
  },
  "ISFJ-O-Capricorn": {
    "summary": "You are ISFJ with blood type O and Capricorn.",
    "//": 334
  },
  "ISFJ-O-Aquarius": {
    "summary": "You are ISFJ with blood type O and Aquarius.",
    "//": 335
  },
  "ISFJ-O-Pisces": {
    "summary": "You are ISFJ with blood type O and Pisces.",
    "//": 336
  },
  "ISFP-A-Aries": {
    "summary": "You are ISFP with blood type A and Aries.",
    "//": 337
  },
  "ISFP-A-Taurus": {
    "summary": "You are ISFP with blood type A and Taurus.",
    "//": 338
  },
  "ISFP-A-Gemini": {
    "summary": "You are ISFP with blood type A and Gemini.",
    "//": 339
  },
  "ISFP-A-Cancer": {
    "summary": "You are ISFP with blood type A and Cancer.",
    "//": 340
  },
  "ISFP-A-Leo": {
    "summary": "You are ISFP with blood type A and Leo.",
    "//": 341
  },
  "ISFP-A-Virgo": {
    "summary": "You are ISFP with blood type A and Virgo.",
    "//": 342
  },
  "ISFP-A-Libra": {
    "summary": "You are ISFP with blood type A and Libra.",
    "//": 343
  },
  "ISFP-A-Scorpio": {
    "summary": "You are ISFP with blood type A and Scorpio.",
    "//": 344
  },
  "ISFP-A-Sagittarius": {
    "summary": "You are ISFP with blood type A and Sagittarius.",
    "//": 345
  },
  "ISFP-A-Capricorn": {
    "summary": "You are ISFP with blood type A and Capricorn.",
    "//": 346
  },
  "ISFP-A-Aquarius": {
    "summary": "You are ISFP with blood type A and Aquarius.",
    "//": 347
  },
  "ISFP-A-Pisces": {
    "summary": "You are ISFP with blood type A and Pisces.",
    "//": 348
  },
  "ISFP-B-Aries": {
    "summary": "You are ISFP with blood type B and Aries.",
    "//": 349
  },
  "ISFP-B-Taurus": {
    "summary": "You are ISFP with blood type B and Taurus.",
    "//": 350
  },
  "ISFP-B-Gemini": {
    "summary": "You are ISFP with blood type B and Gemini.",
    "//": 351
  },
  "ISFP-B-Cancer": {
    "summary": "You are ISFP with blood type B and Cancer.",
    "//": 352
  },
  "ISFP-B-Leo": {
    "summary": "You are ISFP with blood type B and Leo.",
    "//": 353
  },
  "ISFP-B-Virgo": {
    "summary": "You are ISFP with blood type B and Virgo.",
    "//": 354
  },
  "ISFP-B-Libra": {
    "summary": "You are ISFP with blood type B and Libra.",
    "//": 355
  },
  "ISFP-B-Scorpio": {
    "summary": "You are ISFP with blood type B and Scorpio.",
    "//": 356
  },
  "ISFP-B-Sagittarius": {
    "summary": "You are ISFP with blood type B and Sagittarius.",
    "//": 357
  },
  "ISFP-B-Capricorn": {
    "summary": "You are ISFP with blood type B and Capricorn.",
    "//": 358
  },
  "ISFP-B-Aquarius": {
    "summary": "You are ISFP with blood type B and Aquarius.",
    "//": 359
  },
  "ISFP-B-Pisces": {
    "summary": "You are ISFP with blood type B and Pisces.",
    "//": 360
  },
  "ISFP-AB-Aries": {
    "summary": "You are ISFP with blood type AB and Aries.",
    "//": 361
  },
  "ISFP-AB-Taurus": {
    "summary": "You are ISFP with blood type AB and Taurus.",
    "//": 362
  },
  "ISFP-AB-Gemini": {
    "summary": "You are ISFP with blood type AB and Gemini.",
    "//": 363
  },
  "ISFP-AB-Cancer": {
    "summary": "You are ISFP with blood type AB and Cancer.",
    "//": 364
  },
  "ISFP-AB-Leo": {
    "summary": "You are ISFP with blood type AB and Leo.",
    "//": 365
  },
  "ISFP-AB-Virgo": {
    "summary": "You are ISFP with blood type AB and Virgo.",
    "//": 366
  },
  "ISFP-AB-Libra": {
    "summary": "You are ISFP with blood type AB and Libra.",
    "//": 367
  },
  "ISFP-AB-Scorpio": {
    "summary": "You are ISFP with blood type AB and Scorpio.",
    "//": 368
  },
  "ISFP-AB-Sagittarius": {
    "summary": "You are ISFP with blood type AB and Sagittarius.",
    "//": 369
  },
  "ISFP-AB-Capricorn": {
    "summary": "You are ISFP with blood type AB and Capricorn.",
    "//": 370
  },
  "ISFP-AB-Aquarius": {
    "summary": "You are ISFP with blood type AB and Aquarius.",
    "//": 371
  },
  "ISFP-AB-Pisces": {
    "summary": "You are ISFP with blood type AB and Pisces.",
    "//": 372
  },
  "ISFP-O-Aries": {
    "summary": "You are ISFP with blood type O and Aries.",
    "//": 373
  },
  "ISFP-O-Taurus": {
    "summary": "You are ISFP with blood type O and Taurus.",
    "//": 374
  },
  "ISFP-O-Gemini": {
    "summary": "You are ISFP with blood type O and Gemini.",
    "//": 375
  },
  "ISFP-O-Cancer": {
    "summary": "You are ISFP with blood type O and Cancer.",
    "//": 376
  },
  "ISFP-O-Leo": {
    "summary": "You are ISFP with blood type O and Leo.",
    "//": 377
  },
  "ISFP-O-Virgo": {
    "summary": "You are ISFP with blood type O and Virgo.",
    "//": 378
  },
  "ISFP-O-Libra": {
    "summary": "You are ISFP with blood type O and Libra.",
    "//": 379
  },
  "ISFP-O-Scorpio": {
    "summary": "You are ISFP with blood type O and Scorpio.",
    "//": 380
  },
  "ISFP-O-Sagittarius": {
    "summary": "You are ISFP with blood type O and Sagittarius.",
    "//": 381
  },
  "ISFP-O-Capricorn": {
    "summary": "You are ISFP with blood type O and Capricorn.",
    "//": 382
  },
  "ISFP-O-Aquarius": {
    "summary": "You are ISFP with blood type O and Aquarius.",
    "//": 383
  },
  "ISFP-O-Pisces": {
    "summary": "You are ISFP with blood type O and Pisces.",
    "//": 384
  },
  "ENFJ-A-Aries": {
    "summary": "You are ENFJ with blood type A and Aries.",
    "//": 385
  },
  "ENFJ-A-Taurus": {
    "summary": "You are ENFJ with blood type A and Taurus.",
    "//": 386
  },
  "ENFJ-A-Gemini": {
    "summary": "You are ENFJ with blood type A and Gemini.",
    "//": 387
  },
  "ENFJ-A-Cancer": {
    "summary": "You are ENFJ with blood type A and Cancer.",
    "//": 388
  },
  "ENFJ-A-Leo": {
    "summary": "You are ENFJ with blood type A and Leo.",
    "//": 389
  },
  "ENFJ-A-Virgo": {
    "summary": "You are ENFJ with blood type A and Virgo.",
    "//": 390
  },
  "ENFJ-A-Libra": {
    "summary": "You are ENFJ with blood type A and Libra.",
    "//": 391
  },
  "ENFJ-A-Scorpio": {
    "summary": "You are ENFJ with blood type A and Scorpio.",
    "//": 392
  },
  "ENFJ-A-Sagittarius": {
    "summary": "You are ENFJ with blood type A and Sagittarius.",
    "//": 393
  },
  "ENFJ-A-Capricorn": {
    "summary": "You are ENFJ with blood type A and Capricorn.",
    "//": 394
  },
  "ENFJ-A-Aquarius": {
    "summary": "You are ENFJ with blood type A and Aquarius.",
    "//": 395
  },
  "ENFJ-A-Pisces": {
    "summary": "You are ENFJ with blood type A and Pisces.",
    "//": 396
  },
  "ENFJ-B-Aries": {
    "summary": "You are ENFJ with blood type B and Aries.",
    "//": 397
  },
  "ENFJ-B-Taurus": {
    "summary": "You are ENFJ with blood type B and Taurus.",
    "//": 398
  },
  "ENFJ-B-Gemini": {
    "summary": "You are ENFJ with blood type B and Gemini.",
    "//": 399
  },
  "ENFJ-B-Cancer": {
    "summary": "You are ENFJ with blood type B and Cancer.",
    "//": 400
  },
  "ENFJ-B-Leo": {
    "summary": "You are ENFJ with blood type B and Leo. Charismatic Champion\n\nOverview: Meet the 'Charismatic Champion'—a whirlwind of charisma, enthusiasm, and boundless energy. This dazzling combo makes for a rollercoaster ride of romance that's as exhilarating as it is unforgettable.\n\nKey Traits:\n\n1. ENFJ (Extraverted, Intuitive, Feeling, Judging):\n  - Natural Leaders: They can rally a crowd while planning a surprise party.\n  - Warm and Compassionate: These folks make everyone feel like they belong.\n  - Inspirational: They’re the friend who’ll give you pep talks until you believe you can conquer the world.\n\n2. Blood Type B:\n  - Individualistic: They march to the beat of their own drum, and it’s usually an awesome drum solo.\n  - Creative: Always coming up with unique date ideas or quirky gifts.\n  - Flexible: They can go with the flow and adapt to whatever life throws at them.\n\n3. Leo (Zodiac Sign):\n  - Confident: They light up a room with their presence and a smile that could power a small city.\n  - Generous: Expect grand gestures and lavish surprises.\n  - Loyal and Protective: They’re your knight in shining armor, ready to defend you against all odds.\n\nManifestation in Romantic Relationships:\n\n1. Enthusiastic and Passionate Love:\n  - The 'Charismatic Champion' loves with a fervor that’s nothing short of contagious. Think of them as your personal cheerleader in the game of life.\n\n2. Inspiring and Motivational Partner:\n  - With Leo’s fiery passion and ENFJ’s motivational spirit, they’re the perfect blend of coach and fan club. They’ll push you to achieve your dreams while celebrating every victory.\n\n3. Generous and Grand Gestures:\n  - Be prepared for surprise getaways, heartfelt gifts, and romantic dates that seem like scenes from a movie. Their love language is all about showing you how special you are.\n\n4. Warm and Affectionate Communication:\n  - Expect heartwarming conversations that make you feel like the center of their universe. They’re experts at making you feel cherished and adored.\n\n5. Protective and Loyal:\n  - Whether it’s standing up for you or ensuring your happiness, they’ve got your back like a fierce lion guarding its pride.\n\nPotential Challenges:\n\n1. Overbearing Nature:\n  - Their intense energy and desire to help can sometimes feel a bit overwhelming. They mean well, but sometimes a little space is needed.\n\n2. Need for Attention:\n  - They thrive on appreciation and can get a bit sulky if they feel ignored. Remember to give them their fair share of the spotlight.\n\n3. Perfectionism:\n  - They set high standards for themselves and their partners. While this can be motivating, it’s important to remind them that it’s okay to relax and be imperfect sometimes.\n\nConclusion: The 'Charismatic Champion' in a romantic relationship is like a burst of sunshine—warm, energetic, and life-affirming. They’re the partner who makes every day feel like an adventure and every moment feel significant. Just make sure to balance their need for attention with mutual respect, and you’re in for an exhilarating, joy-filled journey together."
  },
  "ENFJ-B-Virgo": {
    "summary": "You are ENFJ with blood type B and Virgo.",
    "//": 402
  },
  "ENFJ-B-Libra": {
    "summary": "You are ENFJ with blood type B and Libra.",
    "//": 403
  },
  "ENFJ-B-Scorpio": {
    "summary": "You are ENFJ with blood type B and Scorpio.",
    "//": 404
  },
  "ENFJ-B-Sagittarius": {
    "summary": "You are ENFJ with blood type B and Sagittarius.",
    "//": 405
  },
  "ENFJ-B-Capricorn": {
    "summary": "You are ENFJ with blood type B and Capricorn.",
    "//": 406
  },
  "ENFJ-B-Aquarius": {
    "summary": "You are ENFJ with blood type B and Aquarius.",
    "//": 407
  },
  "ENFJ-B-Pisces": {
    "summary": "You are ENFJ with blood type B and Pisces.",
    "//": 408
  },
  "ENFJ-AB-Aries": {
    "summary": "You are ENFJ with blood type AB and Aries.",
    "//": 409
  },
  "ENFJ-AB-Taurus": {
    "summary": "You are ENFJ with blood type AB and Taurus.",
    "//": 410
  },
  "ENFJ-AB-Gemini": {
    "summary": "You are ENFJ with blood type AB and Gemini.",
    "//": 411
  },
  "ENFJ-AB-Cancer": {
    "summary": "You are ENFJ with blood type AB and Cancer.",
    "//": 412
  },
  "ENFJ-AB-Leo": {
    "summary": "You are ENFJ with blood type AB and Leo.",
    "//": 413
  },
  "ENFJ-AB-Virgo": {
    "summary": "You are ENFJ with blood type AB and Virgo.",
    "//": 414
  },
  "ENFJ-AB-Libra": {
    "summary": "You are ENFJ with blood type AB and Libra.",
    "//": 415
  },
  "ENFJ-AB-Scorpio": {
    "summary": "You are ENFJ with blood type AB and Scorpio.",
    "//": 416
  },
  "ENFJ-AB-Sagittarius": {
    "summary": "You are ENFJ with blood type AB and Sagittarius.",
    "//": 417
  },
  "ENFJ-AB-Capricorn": {
    "summary": "You are ENFJ with blood type AB and Capricorn.",
    "//": 418
  },
  "ENFJ-AB-Aquarius": {
    "summary": "You are ENFJ with blood type AB and Aquarius.",
    "//": 419
  },
  "ENFJ-AB-Pisces": {
    "summary": "You are ENFJ with blood type AB and Pisces.",
    "//": 420
  },
  "ENFJ-O-Aries": {
    "summary": "You are ENFJ with blood type O and Aries.",
    "//": 421
  },
  "ENFJ-O-Taurus": {
    "summary": "You are ENFJ with blood type O and Taurus.",
    "//": 422
  },
  "ENFJ-O-Gemini": {
    "summary": "You are ENFJ with blood type O and Gemini.",
    "//": 423
  },
  "ENFJ-O-Cancer": {
    "summary": "You are ENFJ with blood type O and Cancer.",
    "//": 424
  },
  "ENFJ-O-Leo": {
    "summary": "You are ENFJ with blood type O and Leo.",
    "//": 425
  },
  "ENFJ-O-Virgo": {
    "summary": "You are ENFJ with blood type O and Virgo.",
    "//": 426
  },
  "ENFJ-O-Libra": {
    "summary": "You are ENFJ with blood type O and Libra.",
    "//": 427
  },
  "ENFJ-O-Scorpio": {
    "summary": "You are ENFJ with blood type O and Scorpio.",
    "//": 428
  },
  "ENFJ-O-Sagittarius": {
    "summary": "You are ENFJ with blood type O and Sagittarius.",
    "//": 429
  },
  "ENFJ-O-Capricorn": {
    "summary": "You are ENFJ with blood type O and Capricorn.",
    "//": 430
  },
  "ENFJ-O-Aquarius": {
    "summary": "You are ENFJ with blood type O and Aquarius.",
    "//": 431
  },
  "ENFJ-O-Pisces": {
    "summary": "You are ENFJ with blood type O and Pisces.",
    "//": 432
  },
  "ENTJ-A-Aries": {
    "summary": "You are ENTJ with blood type A and Aries.",
    "//": 433
  },
  "ENTJ-A-Taurus": {
    "summary": "You are ENTJ with blood type A and Taurus.",
    "//": 434
  },
  "ENTJ-A-Gemini": {
    "summary": "You are ENTJ with blood type A and Gemini.",
    "//": 435
  },
  "ENTJ-A-Cancer": {
    "summary": "You are ENTJ with blood type A and Cancer.",
    "//": 436
  },
  "ENTJ-A-Leo": {
    "summary": "You are ENTJ with blood type A and Leo.",
    "//": 437
  },
  "ENTJ-A-Virgo": {
    "summary": "You are ENTJ with blood type A and Virgo.",
    "//": 438
  },
  "ENTJ-A-Libra": {
    "summary": "You are ENTJ with blood type A and Libra.",
    "//": 439
  },
  "ENTJ-A-Scorpio": {
    "summary": "You are ENTJ with blood type A and Scorpio.",
    "//": 440
  },
  "ENTJ-A-Sagittarius": {
    "summary": "You are ENTJ with blood type A and Sagittarius.",
    "//": 441
  },
  "ENTJ-A-Capricorn": {
    "summary": "You are ENTJ with blood type A and Capricorn.",
    "//": 442
  },
  "ENTJ-A-Aquarius": {
    "summary": "You are ENTJ with blood type A and Aquarius.",
    "//": 443
  },
  "ENTJ-A-Pisces": {
    "summary": "You are ENTJ with blood type A and Pisces.",
    "//": 444
  },
  "ENTJ-B-Aries": {
    "summary": "You are ENTJ with blood type B and Aries.",
    "//": 445
  },
  "ENTJ-B-Taurus": {
    "summary": "You are ENTJ with blood type B and Taurus.",
    "//": 446
  },
  "ENTJ-B-Gemini": {
    "summary": "You are ENTJ with blood type B and Gemini.",
    "//": 447
  },
  "ENTJ-B-Cancer": {
    "summary": "You are ENTJ with blood type B and Cancer.",
    "//": 448
  },
  "ENTJ-B-Leo": {
    "summary": "You are ENTJ with blood type B and Leo.",
    "//": 449
  },
  "ENTJ-B-Virgo": {
    "summary": "You are ENTJ with blood type B and Virgo.",
    "//": 450
  },
  "ENTJ-B-Libra": {
    "summary": "You are ENTJ with blood type B and Libra.",
    "//": 451
  },
  "ENTJ-B-Scorpio": {
    "summary": "You are ENTJ with blood type B and Scorpio.",
    "//": 452
  },
  "ENTJ-B-Sagittarius": {
    "summary": "You are ENTJ with blood type B and Sagittarius.",
    "//": 453
  },
  "ENTJ-B-Capricorn": {
    "summary": "You are ENTJ with blood type B and Capricorn.",
    "//": 454
  },
  "ENTJ-B-Aquarius": {
    "summary": "You are ENTJ with blood type B and Aquarius.",
    "//": 455
  },
  "ENTJ-B-Pisces": {
    "summary": "You are ENTJ with blood type B and Pisces.",
    "//": 456
  },
  "ENTJ-AB-Aries": {
    "summary": "You are ENTJ with blood type AB and Aries.",
    "//": 457
  },
  "ENTJ-AB-Taurus": {
    "summary": "You are ENTJ with blood type AB and Taurus.",
    "//": 458
  },
  "ENTJ-AB-Gemini": {
    "summary": "You are ENTJ with blood type AB and Gemini.",
    "//": 459
  },
  "ENTJ-AB-Cancer": {
    "summary": "You are ENTJ with blood type AB and Cancer.",
    "//": 460
  },
  "ENTJ-AB-Leo": {
    "summary": "You are ENTJ with blood type AB and Leo.",
    "//": 461
  },
  "ENTJ-AB-Virgo": {
    "summary": "You are ENTJ with blood type AB and Virgo.",
    "//": 462
  },
  "ENTJ-AB-Libra": {
    "summary": "You are ENTJ with blood type AB and Libra.",
    "//": 463
  },
  "ENTJ-AB-Scorpio": {
    "summary": "You are ENTJ with blood type AB and Scorpio.",
    "//": 464
  },
  "ENTJ-AB-Sagittarius": {
    "summary": "You are ENTJ with blood type AB and Sagittarius.",
    "//": 465
  },
  "ENTJ-AB-Capricorn": {
    "summary": "You are ENTJ with blood type AB and Capricorn.",
    "//": 466
  },
  "ENTJ-AB-Aquarius": {
    "summary": "You are ENTJ with blood type AB and Aquarius.",
    "//": 467
  },
  "ENTJ-AB-Pisces": {
    "summary": "You are ENTJ with blood type AB and Pisces.",
    "//": 468
  },
  "ENTJ-O-Aries": {
    "summary": "You are ENTJ with blood type O and Aries.",
    "//": 469
  },
  "ENTJ-O-Taurus": {
    "summary": "You are ENTJ with blood type O and Taurus.",
    "//": 470
  },
  "ENTJ-O-Gemini": {
    "summary": "You are ENTJ with blood type O and Gemini.",
    "//": 471
  },
  "ENTJ-O-Cancer": {
    "summary": "You are ENTJ with blood type O and Cancer.",
    "//": 472
  },
  "ENTJ-O-Leo": {
    "summary": "You are ENTJ with blood type O and Leo.",
    "//": 473
  },
  "ENTJ-O-Virgo": {
    "summary": "You are ENTJ with blood type O and Virgo.",
    "//": 474
  },
  "ENTJ-O-Libra": {
    "summary": "You are ENTJ with blood type O and Libra.",
    "//": 475
  },
  "ENTJ-O-Scorpio": {
    "summary": "You are ENTJ with blood type O and Scorpio.",
    "//": 476
  },
  "ENTJ-O-Sagittarius": {
    "summary": "You are ENTJ with blood type O and Sagittarius.",
    "//": 477
  },
  "ENTJ-O-Capricorn": {
    "summary": "You are ENTJ with blood type O and Capricorn.",
    "//": 478
  },
  "ENTJ-O-Aquarius": {
    "summary": "You are ENTJ with blood type O and Aquarius.",
    "//": 479
  },
  "ENTJ-O-Pisces": {
    "summary": "You are ENTJ with blood type O and Pisces.",
    "//": 480
  },
  "ENFP-A-Aries": {
    "summary": "You are ENFP with blood type A and Aries.",
    "//": 481
  },
  "ENFP-A-Taurus": {
    "summary": "You are ENFP with blood type A and Taurus.",
    "//": 482
  },
  "ENFP-A-Gemini": {
    "summary": "You are ENFP with blood type A and Gemini.",
    "//": 483
  },
  "ENFP-A-Cancer": {
    "summary": "You are ENFP with blood type A and Cancer.",
    "//": 484
  },
  "ENFP-A-Leo": {
    "summary": "You are ENFP with blood type A and Leo.",
    "//": 485
  },
  "ENFP-A-Virgo": {
    "summary": "You are ENFP with blood type A and Virgo.",
    "//": 486
  },
  "ENFP-A-Libra": {
    "summary": "You are ENFP with blood type A and Libra.",
    "//": 487
  },
  "ENFP-A-Scorpio": {
    "summary": "You are ENFP with blood type A and Scorpio.",
    "//": 488
  },
  "ENFP-A-Sagittarius": {
    "summary": "You are ENFP with blood type A and Sagittarius.",
    "//": 489
  },
  "ENFP-A-Capricorn": {
    "summary": "You are ENFP with blood type A and Capricorn.",
    "//": 490
  },
  "ENFP-A-Aquarius": {
    "summary": "You are ENFP with blood type A and Aquarius.",
    "//": 491
  },
  "ENFP-A-Pisces": {
    "summary": "You are ENFP with blood type A and Pisces.",
    "//": 492
  },
  "ENFP-B-Aries": {
    "summary": "You are ENFP with blood type B and Aries.",
    "//": 493
  },
  "ENFP-B-Taurus": {
    "summary": "You are ENFP with blood type B and Taurus.",
    "//": 494
  },
  "ENFP-B-Gemini": {
    "summary": "You are ENFP with blood type B and Gemini.",
    "//": 495
  },
  "ENFP-B-Cancer": {
    "summary": "You are ENFP with blood type B and Cancer.",
    "//": 496
  },
  "ENFP-B-Leo": {
    "summary": "You are ENFP with blood type B and Leo.",
    "//": 497
  },
  "ENFP-B-Virgo": {
    "summary": "You are ENFP with blood type B and Virgo.",
    "//": 498
  },
  "ENFP-B-Libra": {
    "summary": "You are ENFP with blood type B and Libra.",
    "//": 499
  },
  "ENFP-B-Scorpio": {
    "summary": "You are ENFP with blood type B and Scorpio.",
    "//": 500
  },
  "ENFP-B-Sagittarius": {
    "summary": "You are ENFP with blood type B and Sagittarius.",
    "//": 501
  },
  "ENFP-B-Capricorn": {
    "summary": "You are ENFP with blood type B and Capricorn.",
    "//": 502
  },
  "ENFP-B-Aquarius": {
    "summary": "You are ENFP with blood type B and Aquarius.",
    "//": 503
  },
  "ENFP-B-Pisces": {
    "summary": "You are ENFP with blood type B and Pisces.",
    "//": 504
  },
  "ENFP-AB-Aries": {
    "summary": "You are ENFP with blood type AB and Aries.",
    "//": 505
  },
  "ENFP-AB-Taurus": {
    "summary": "You are ENFP with blood type AB and Taurus.",
    "//": 506
  },
  "ENFP-AB-Gemini": {
    "summary": "You are ENFP with blood type AB and Gemini.",
    "//": 507
  },
  "ENFP-AB-Cancer": {
    "summary": "You are ENFP with blood type AB and Cancer.",
    "//": 508
  },
  "ENFP-AB-Leo": {
    "summary": "You are ENFP with blood type AB and Leo.",
    "//": 509
  },
  "ENFP-AB-Virgo": {
    "summary": "You are ENFP with blood type AB and Virgo.",
    "//": 510
  },
  "ENFP-AB-Libra": {
    "summary": "You are ENFP with blood type AB and Libra.",
    "//": 511
  },
  "ENFP-AB-Scorpio": {
    "summary": "You are ENFP with blood type AB and Scorpio.",
    "//": 512
  },
  "ENFP-AB-Sagittarius": {
    "summary": "You are ENFP with blood type AB and Sagittarius.",
    "//": 513
  },
  "ENFP-AB-Capricorn": {
    "summary": "You are ENFP with blood type AB and Capricorn.",
    "//": 514
  },
  "ENFP-AB-Aquarius": {
    "summary": "You are ENFP with blood type AB and Aquarius.",
    "//": 515
  },
  "ENFP-AB-Pisces": {
    "summary": "You are ENFP with blood type AB and Pisces.",
    "//": 516
  },
  "ENFP-O-Aries": {
    "summary": "You are ENFP with blood type O and Aries.",
    "//": 517
  },
  "ENFP-O-Taurus": {
    "summary": "You are ENFP with blood type O and Taurus.",
    "//": 518
  },
  "ENFP-O-Gemini": {
    "summary": "You are ENFP with blood type O and Gemini.",
    "//": 519
  },
  "ENFP-O-Cancer": {
    "summary": "You are ENFP with blood type O and Cancer.",
    "//": 520
  },
  "ENFP-O-Leo": {
    "summary": "You are ENFP with blood type O and Leo.",
    "//": 521
  },
  "ENFP-O-Virgo": {
    "summary": "You are ENFP with blood type O and Virgo.",
    "//": 522
  },
  "ENFP-O-Libra": {
    "summary": "You are ENFP with blood type O and Libra.",
    "//": 523
  },
  "ENFP-O-Scorpio": {
    "summary": "You are ENFP with blood type O and Scorpio.",
    "//": 524
  },
  "ENFP-O-Sagittarius": {
    "summary": "You are ENFP with blood type O and Sagittarius.",
    "//": 525
  },
  "ENFP-O-Capricorn": {
    "summary": "You are ENFP with blood type O and Capricorn.",
    "//": 526
  },
  "ENFP-O-Aquarius": {
    "summary": "You are ENFP with blood type O and Aquarius.",
    "//": 527
  },
  "ENFP-O-Pisces": {
    "summary": "You are ENFP with blood type O and Pisces.",
    "//": 528
  },
  "ENTP-A-Aries": {
    "summary": "You are ENTP with blood type A and Aries.",
    "//": 529
  },
  "ENTP-A-Taurus": {
    "summary": "You are ENTP with blood type A and Taurus.",
    "//": 530
  },
  "ENTP-A-Gemini": {
    "summary": "You are ENTP with blood type A and Gemini.",
    "//": 531
  },
  "ENTP-A-Cancer": {
    "summary": "You are ENTP with blood type A and Cancer.",
    "//": 532
  },
  "ENTP-A-Leo": {
    "summary": "You are ENTP with blood type A and Leo.",
    "//": 533
  },
  "ENTP-A-Virgo": {
    "summary": "You are ENTP with blood type A and Virgo.",
    "//": 534
  },
  "ENTP-A-Libra": {
    "summary": "You are ENTP with blood type A and Libra.",
    "//": 535
  },
  "ENTP-A-Scorpio": {
    "summary": "You are ENTP with blood type A and Scorpio.",
    "//": 536
  },
  "ENTP-A-Sagittarius": {
    "summary": "You are ENTP with blood type A and Sagittarius.",
    "//": 537
  },
  "ENTP-A-Capricorn": {
    "summary": "You are ENTP with blood type A and Capricorn.",
    "//": 538
  },
  "ENTP-A-Aquarius": {
    "summary": "You are ENTP with blood type A and Aquarius.",
    "//": 539
  },
  "ENTP-A-Pisces": {
    "summary": "You are ENTP with blood type A and Pisces.",
    "//": 540
  },
  "ENTP-B-Aries": {
    "summary": "You are ENTP with blood type B and Aries.",
    "//": 541
  },
  "ENTP-B-Taurus": {
    "summary": "You are ENTP with blood type B and Taurus.",
    "//": 542
  },
  "ENTP-B-Gemini": {
    "summary": "You are ENTP with blood type B and Gemini.",
    "//": 543
  },
  "ENTP-B-Cancer": {
    "summary": "You are ENTP with blood type B and Cancer.",
    "//": 544
  },
  "ENTP-B-Leo": {
    "summary": "You are ENTP with blood type B and Leo.",
    "//": 545
  },
  "ENTP-B-Virgo": {
    "summary": "You are ENTP with blood type B and Virgo.",
    "//": 546
  },
  "ENTP-B-Libra": {
    "summary": "You are ENTP with blood type B and Libra.",
    "//": 547
  },
  "ENTP-B-Scorpio": {
    "summary": "You are ENTP with blood type B and Scorpio.",
    "//": 548
  },
  "ENTP-B-Sagittarius": {
    "summary": "You are ENTP with blood type B and Sagittarius.",
    "//": 549
  },
  "ENTP-B-Capricorn": {
    "summary": "You are ENTP with blood type B and Capricorn.",
    "//": 550
  },
  "ENTP-B-Aquarius": {
    "summary": "You are ENTP with blood type B and Aquarius.",
    "//": 551
  },
  "ENTP-B-Pisces": {
    "summary": "You are ENTP with blood type B and Pisces.",
    "//": 552
  },
  "ENTP-AB-Aries": {
    "summary": "You are ENTP with blood type AB and Aries.",
    "//": 553
  },
  "ENTP-AB-Taurus": {
    "summary": "You are ENTP with blood type AB and Taurus.",
    "//": 554
  },
  "ENTP-AB-Gemini": {
    "summary": "You are ENTP with blood type AB and Gemini.",
    "//": 555
  },
  "ENTP-AB-Cancer": {
    "summary": "You are ENTP with blood type AB and Cancer.",
    "//": 556
  },
  "ENTP-AB-Leo": {
    "summary": "You are ENTP with blood type AB and Leo.",
    "//": 557
  },
  "ENTP-AB-Virgo": {
    "summary": "You are ENTP with blood type AB and Virgo.",
    "//": 558
  },
  "ENTP-AB-Libra": {
    "summary": "You are ENTP with blood type AB and Libra.",
    "//": 559
  },
  "ENTP-AB-Scorpio": {
    "summary": "You are ENTP with blood type AB and Scorpio.",
    "//": 560
  },
  "ENTP-AB-Sagittarius": {
    "summary": "You are ENTP with blood type AB and Sagittarius.",
    "//": 561
  },
  "ENTP-AB-Capricorn": {
    "summary": "You are ENTP with blood type AB and Capricorn.",
    "//": 562
  },
  "ENTP-AB-Aquarius": {
    "summary": "You are ENTP with blood type AB and Aquarius.",
    "//": 563
  },
  "ENTP-AB-Pisces": {
    "summary": "You are ENTP with blood type AB and Pisces.",
    "//": 564
  },
  "ENTP-O-Aries": {
    "summary": "You are ENTP with blood type O and Aries.",
    "//": 565
  },
  "ENTP-O-Taurus": {
    "summary": "You are ENTP with blood type O and Taurus.",
    "//": 566
  },
  "ENTP-O-Gemini": {
    "summary": "You are ENTP with blood type O and Gemini.",
    "//": 567
  },
  "ENTP-O-Cancer": {
    "summary": "You are ENTP with blood type O and Cancer.",
    "//": 568
  },
  "ENTP-O-Leo": {
    "summary": "You are ENTP with blood type O and Leo.",
    "//": 569
  },
  "ENTP-O-Virgo": {
    "summary": "You are ENTP with blood type O and Virgo.",
    "//": 570
  },
  "ENTP-O-Libra": {
    "summary": "You are ENTP with blood type O and Libra.",
    "//": 571
  },
  "ENTP-O-Scorpio": {
    "summary": "You are ENTP with blood type O and Scorpio.",
    "//": 572
  },
  "ENTP-O-Sagittarius": {
    "summary": "You are ENTP with blood type O and Sagittarius.",
    "//": 573
  },
  "ENTP-O-Capricorn": {
    "summary": "You are ENTP with blood type O and Capricorn.",
    "//": 574
  },
  "ENTP-O-Aquarius": {
    "summary": "You are ENTP with blood type O and Aquarius.",
    "//": 575
  },
  "ENTP-O-Pisces": {
    "summary": "You are ENTP with blood type O and Pisces.",
    "//": 576
  },
  "ESTJ-A-Aries": {
    "summary": "You are ESTJ with blood type A and Aries.",
    "//": 577
  },
  "ESTJ-A-Taurus": {
    "summary": "You are ESTJ with blood type A and Taurus.",
    "//": 578
  },
  "ESTJ-A-Gemini": {
    "summary": "You are ESTJ with blood type A and Gemini.",
    "//": 579
  },
  "ESTJ-A-Cancer": {
    "summary": "You are ESTJ with blood type A and Cancer.",
    "//": 580
  },
  "ESTJ-A-Leo": {
    "summary": "You are ESTJ with blood type A and Leo.",
    "//": 581
  },
  "ESTJ-A-Virgo": {
    "summary": "You are ESTJ with blood type A and Virgo.",
    "//": 582
  },
  "ESTJ-A-Libra": {
    "summary": "You are ESTJ with blood type A and Libra.",
    "//": 583
  },
  "ESTJ-A-Scorpio": {
    "summary": "You are ESTJ with blood type A and Scorpio.",
    "//": 584
  },
  "ESTJ-A-Sagittarius": {
    "summary": "You are ESTJ with blood type A and Sagittarius.",
    "//": 585
  },
  "ESTJ-A-Capricorn": {
    "summary": "You are ESTJ with blood type A and Capricorn.",
    "//": 586
  },
  "ESTJ-A-Aquarius": {
    "summary": "You are ESTJ with blood type A and Aquarius.",
    "//": 587
  },
  "ESTJ-A-Pisces": {
    "summary": "You are ESTJ with blood type A and Pisces.",
    "//": 588
  },
  "ESTJ-B-Aries": {
    "summary": "You are ESTJ with blood type B and Aries.",
    "//": 589
  },
  "ESTJ-B-Taurus": {
    "summary": "You are ESTJ with blood type B and Taurus.",
    "//": 590
  },
  "ESTJ-B-Gemini": {
    "summary": "You are ESTJ with blood type B and Gemini.",
    "//": 591
  },
  "ESTJ-B-Cancer": {
    "summary": "You are ESTJ with blood type B and Cancer.",
    "//": 592
  },
  "ESTJ-B-Leo": {
    "summary": "You are ESTJ with blood type B and Leo.",
    "//": 593
  },
  "ESTJ-B-Virgo": {
    "summary": "You are ESTJ with blood type B and Virgo.",
    "//": 594
  },
  "ESTJ-B-Libra": {
    "summary": "You are ESTJ with blood type B and Libra.",
    "//": 595
  },
  "ESTJ-B-Scorpio": {
    "summary": "You are ESTJ with blood type B and Scorpio.",
    "//": 596
  },
  "ESTJ-B-Sagittarius": {
    "summary": "You are ESTJ with blood type B and Sagittarius.",
    "//": 597
  },
  "ESTJ-B-Capricorn": {
    "summary": "You are ESTJ with blood type B and Capricorn.",
    "//": 598
  },
  "ESTJ-B-Aquarius": {
    "summary": "You are ESTJ with blood type B and Aquarius.",
    "//": 599
  },
  "ESTJ-B-Pisces": {
    "summary": "You are ESTJ with blood type B and Pisces.",
    "//": 600
  },
  "ESTJ-AB-Aries": {
    "summary": "You are ESTJ with blood type AB and Aries.",
    "//": 601
  },
  "ESTJ-AB-Taurus": {
    "summary": "You are ESTJ with blood type AB and Taurus.",
    "//": 602
  },
  "ESTJ-AB-Gemini": {
    "summary": "You are ESTJ with blood type AB and Gemini.",
    "//": 603
  },
  "ESTJ-AB-Cancer": {
    "summary": "You are ESTJ with blood type AB and Cancer.",
    "//": 604
  },
  "ESTJ-AB-Leo": {
    "summary": "You are ESTJ with blood type AB and Leo.",
    "//": 605
  },
  "ESTJ-AB-Virgo": {
    "summary": "You are ESTJ with blood type AB and Virgo.",
    "//": 606
  },
  "ESTJ-AB-Libra": {
    "summary": "You are ESTJ with blood type AB and Libra.",
    "//": 607
  },
  "ESTJ-AB-Scorpio": {
    "summary": "You are ESTJ with blood type AB and Scorpio.",
    "//": 608
  },
  "ESTJ-AB-Sagittarius": {
    "summary": "You are ESTJ with blood type AB and Sagittarius.",
    "//": 609
  },
  "ESTJ-AB-Capricorn": {
    "summary": "You are ESTJ with blood type AB and Capricorn.",
    "//": 610
  },
  "ESTJ-AB-Aquarius": {
    "summary": "You are ESTJ with blood type AB and Aquarius.",
    "//": 611
  },
  "ESTJ-AB-Pisces": {
    "summary": "You are ESTJ with blood type AB and Pisces.",
    "//": 612
  },
  "ESTJ-O-Aries": {
    "summary": "You are ESTJ with blood type O and Aries.",
    "//": 613
  },
  "ESTJ-O-Taurus": {
    "summary": "You are ESTJ with blood type O and Taurus.",
    "//": 614
  },
  "ESTJ-O-Gemini": {
    "summary": "You are ESTJ with blood type O and Gemini.",
    "//": 615
  },
  "ESTJ-O-Cancer": {
    "summary": "You are ESTJ with blood type O and Cancer.",
    "//": 616
  },
  "ESTJ-O-Leo": {
    "summary": "You are ESTJ with blood type O and Leo.",
    "//": 617
  },
  "ESTJ-O-Virgo": {
    "summary": "You are ESTJ with blood type O and Virgo.",
    "//": 618
  },
  "ESTJ-O-Libra": {
    "summary": "You are ESTJ with blood type O and Libra.",
    "//": 619
  },
  "ESTJ-O-Scorpio": {
    "summary": "You are ESTJ with blood type O and Scorpio.",
    "//": 620
  },
  "ESTJ-O-Sagittarius": {
    "summary": "You are ESTJ with blood type O and Sagittarius.",
    "//": 621
  },
  "ESTJ-O-Capricorn": {
    "summary": "You are ESTJ with blood type O and Capricorn.",
    "//": 622
  },
  "ESTJ-O-Aquarius": {
    "summary": "You are ESTJ with blood type O and Aquarius.",
    "//": 623
  },
  "ESTJ-O-Pisces": {
    "summary": "You are ESTJ with blood type O and Pisces.",
    "//": 624
  },
  "ESTP-A-Aries": {
    "summary": "You are ESTP with blood type A and Aries.",
    "//": 625
  },
  "ESTP-A-Taurus": {
    "summary": "You are ESTP with blood type A and Taurus.",
    "//": 626
  },
  "ESTP-A-Gemini": {
    "summary": "You are ESTP with blood type A and Gemini.",
    "//": 627
  },
  "ESTP-A-Cancer": {
    "summary": "You are ESTP with blood type A and Cancer.",
    "//": 628
  },
  "ESTP-A-Leo": {
    "summary": "You are ESTP with blood type A and Leo.",
    "//": 629
  },
  "ESTP-A-Virgo": {
    "summary": "You are ESTP with blood type A and Virgo.",
    "//": 630
  },
  "ESTP-A-Libra": {
    "summary": "You are ESTP with blood type A and Libra.",
    "//": 631
  },
  "ESTP-A-Scorpio": {
    "summary": "You are ESTP with blood type A and Scorpio.",
    "//": 632
  },
  "ESTP-A-Sagittarius": {
    "summary": "You are ESTP with blood type A and Sagittarius.",
    "//": 633
  },
  "ESTP-A-Capricorn": {
    "summary": "You are ESTP with blood type A and Capricorn.",
    "//": 634
  },
  "ESTP-A-Aquarius": {
    "summary": "You are ESTP with blood type A and Aquarius.",
    "//": 635
  },
  "ESTP-A-Pisces": {
    "summary": "You are ESTP with blood type A and Pisces.",
    "//": 636
  },
  "ESTP-B-Aries": {
    "summary": "You are ESTP with blood type B and Aries.",
    "//": 637
  },
  "ESTP-B-Taurus": {
    "summary": "You are ESTP with blood type B and Taurus.",
    "//": 638
  },
  "ESTP-B-Gemini": {
    "summary": "You are ESTP with blood type B and Gemini.",
    "//": 639
  },
  "ESTP-B-Cancer": {
    "summary": "You are ESTP with blood type B and Cancer.",
    "//": 640
  },
  "ESTP-B-Leo": {
    "summary": "You are ESTP with blood type B and Leo.",
    "//": 641
  },
  "ESTP-B-Virgo": {
    "summary": "You are ESTP with blood type B and Virgo.",
    "//": 642
  },
  "ESTP-B-Libra": {
    "summary": "You are ESTP with blood type B and Libra.",
    "//": 643
  },
  "ESTP-B-Scorpio": {
    "summary": "You are ESTP with blood type B and Scorpio.",
    "//": 644
  },
  "ESTP-B-Sagittarius": {
    "summary": "You are ESTP with blood type B and Sagittarius.",
    "//": 645
  },
  "ESTP-B-Capricorn": {
    "summary": "You are ESTP with blood type B and Capricorn.",
    "//": 646
  },
  "ESTP-B-Aquarius": {
    "summary": "You are ESTP with blood type B and Aquarius.",
    "//": 647
  },
  "ESTP-B-Pisces": {
    "summary": "You are ESTP with blood type B and Pisces.",
    "//": 648
  },
  "ESTP-AB-Aries": {
    "summary": "You are ESTP with blood type AB and Aries.",
    "//": 649
  },
  "ESTP-AB-Taurus": {
    "summary": "You are ESTP with blood type AB and Taurus.",
    "//": 650
  },
  "ESTP-AB-Gemini": {
    "summary": "You are ESTP with blood type AB and Gemini.",
    "//": 651
  },
  "ESTP-AB-Cancer": {
    "summary": "You are ESTP with blood type AB and Cancer.",
    "//": 652
  },
  "ESTP-AB-Leo": {
    "summary": "You are ESTP with blood type AB and Leo.",
    "//": 653
  },
  "ESTP-AB-Virgo": {
    "summary": "You are ESTP with blood type AB and Virgo.",
    "//": 654
  },
  "ESTP-AB-Libra": {
    "summary": "You are ESTP with blood type AB and Libra.",
    "//": 655
  },
  "ESTP-AB-Scorpio": {
    "summary": "You are ESTP with blood type AB and Scorpio.",
    "//": 656
  },
  "ESTP-AB-Sagittarius": {
    "summary": "You are ESTP with blood type AB and Sagittarius.",
    "//": 657
  },
  "ESTP-AB-Capricorn": {
    "summary": "You are ESTP with blood type AB and Capricorn.",
    "//": 658
  },
  "ESTP-AB-Aquarius": {
    "summary": "You are ESTP with blood type AB and Aquarius.",
    "//": 659
  },
  "ESTP-AB-Pisces": {
    "summary": "You are ESTP with blood type AB and Pisces.",
    "//": 660
  },
  "ESTP-O-Aries": {
    "summary": "You are ESTP with blood type O and Aries.",
    "//": 661
  },
  "ESTP-O-Taurus": {
    "summary": "You are ESTP with blood type O and Taurus.",
    "//": 662
  },
  "ESTP-O-Gemini": {
    "summary": "You are ESTP with blood type O and Gemini.",
    "//": 663
  },
  "ESTP-O-Cancer": {
    "summary": "You are ESTP with blood type O and Cancer.",
    "//": 664
  },
  "ESTP-O-Leo": {
    "summary": "You are ESTP with blood type O and Leo.",
    "//": 665
  },
  "ESTP-O-Virgo": {
    "summary": "You are ESTP with blood type O and Virgo.",
    "//": 666
  },
  "ESTP-O-Libra": {
    "summary": "You are ESTP with blood type O and Libra.",
    "//": 667
  },
  "ESTP-O-Scorpio": {
    "summary": "You are ESTP with blood type O and Scorpio.",
    "//": 668
  },
  "ESTP-O-Sagittarius": {
    "summary": "You are ESTP with blood type O and Sagittarius.",
    "//": 669
  },
  "ESTP-O-Capricorn": {
    "summary": "You are ESTP with blood type O and Capricorn.",
    "//": 670
  },
  "ESTP-O-Aquarius": {
    "summary": "You are ESTP with blood type O and Aquarius.",
    "//": 671
  },
  "ESTP-O-Pisces": {
    "summary": "You are ESTP with blood type O and Pisces.",
    "//": 672
  },
  "ESFJ-A-Aries": {
    "summary": "You are ESFJ with blood type A and Aries.",
    "//": 673
  },
  "ESFJ-A-Taurus": {
    "summary": "You are ESFJ with blood type A and Taurus.",
    "//": 674
  },
  "ESFJ-A-Gemini": {
    "summary": "You are ESFJ with blood type A and Gemini.",
    "//": 675
  },
  "ESFJ-A-Cancer": {
    "summary": "You are ESFJ with blood type A and Cancer.",
    "//": 676
  },
  "ESFJ-A-Leo": {
    "summary": "You are ESFJ with blood type A and Leo.",
    "//": 677
  },
  "ESFJ-A-Virgo": {
    "summary": "You are ESFJ with blood type A and Virgo.",
    "//": 678
  },
  "ESFJ-A-Libra": {
    "summary": "You are ESFJ with blood type A and Libra.",
    "//": 679
  },
  "ESFJ-A-Scorpio": {
    "summary": "You are ESFJ with blood type A and Scorpio.",
    "//": 680
  },
  "ESFJ-A-Sagittarius": {
    "summary": "You are ESFJ with blood type A and Sagittarius.",
    "//": 681
  },
  "ESFJ-A-Capricorn": {
    "summary": "You are ESFJ with blood type A and Capricorn.",
    "//": 682
  },
  "ESFJ-A-Aquarius": {
    "summary": "You are ESFJ with blood type A and Aquarius.",
    "//": 683
  },
  "ESFJ-A-Pisces": {
    "summary": "You are ESFJ with blood type A and Pisces.",
    "//": 684
  },
  "ESFJ-B-Aries": {
    "summary": "You are ESFJ with blood type B and Aries.",
    "//": 685
  },
  "ESFJ-B-Taurus": {
    "summary": "You are ESFJ with blood type B and Taurus.",
    "//": 686
  },
  "ESFJ-B-Gemini": {
    "summary": "You are ESFJ with blood type B and Gemini.",
    "//": 687
  },
  "ESFJ-B-Cancer": {
    "summary": "You are ESFJ with blood type B and Cancer.",
    "//": 688
  },
  "ESFJ-B-Leo": {
    "summary": "You are ESFJ with blood type B and Leo.",
    "//": 689
  },
  "ESFJ-B-Virgo": {
    "summary": "You are ESFJ with blood type B and Virgo.",
    "//": 690
  },
  "ESFJ-B-Libra": {
    "summary": "You are ESFJ with blood type B and Libra.",
    "//": 691
  },
  "ESFJ-B-Scorpio": {
    "summary": "You are ESFJ with blood type B and Scorpio.",
    "//": 692
  },
  "ESFJ-B-Sagittarius": {
    "summary": "You are ESFJ with blood type B and Sagittarius.",
    "//": 693
  },
  "ESFJ-B-Capricorn": {
    "summary": "You are ESFJ with blood type B and Capricorn.",
    "//": 694
  },
  "ESFJ-B-Aquarius": {
    "summary": "You are ESFJ with blood type B and Aquarius.",
    "//": 695
  },
  "ESFJ-B-Pisces": {
    "summary": "You are ESFJ with blood type B and Pisces.",
    "//": 696
  },
  "ESFJ-AB-Aries": {
    "summary": "You are ESFJ with blood type AB and Aries.",
    "//": 697
  },
  "ESFJ-AB-Taurus": {
    "summary": "You are ESFJ with blood type AB and Taurus.",
    "//": 698
  },
  "ESFJ-AB-Gemini": {
    "summary": "You are ESFJ with blood type AB and Gemini.",
    "//": 699
  },
  "ESFJ-AB-Cancer": {
    "summary": "You are ESFJ with blood type AB and Cancer.",
    "//": 700
  },
  "ESFJ-AB-Leo": {
    "summary": "You are ESFJ with blood type AB and Leo.",
    "//": 701
  },
  "ESFJ-AB-Virgo": {
    "summary": "You are ESFJ with blood type AB and Virgo.",
    "//": 702
  },
  "ESFJ-AB-Libra": {
    "summary": "You are ESFJ with blood type AB and Libra.",
    "//": 703
  },
  "ESFJ-AB-Scorpio": {
    "summary": "You are ESFJ with blood type AB and Scorpio.",
    "//": 704
  },
  "ESFJ-AB-Sagittarius": {
    "summary": "You are ESFJ with blood type AB and Sagittarius.",
    "//": 705
  },
  "ESFJ-AB-Capricorn": {
    "summary": "You are ESFJ with blood type AB and Capricorn.",
    "//": 706
  },
  "ESFJ-AB-Aquarius": {
    "summary": "You are ESFJ with blood type AB and Aquarius.",
    "//": 707
  },
  "ESFJ-AB-Pisces": {
    "summary": "You are ESFJ with blood type AB and Pisces.",
    "//": 708
  },
  "ESFJ-O-Aries": {
    "summary": "You are ESFJ with blood type O and Aries.",
    "//": 709
  },
  "ESFJ-O-Taurus": {
    "summary": "You are ESFJ with blood type O and Taurus.",
    "//": 710
  },
  "ESFJ-O-Gemini": {
    "summary": "You are ESFJ with blood type O and Gemini.",
    "//": 711
  },
  "ESFJ-O-Cancer": {
    "summary": "You are ESFJ with blood type O and Cancer.",
    "//": 712
  },
  "ESFJ-O-Leo": {
    "summary": "You are ESFJ with blood type O and Leo.",
    "//": 713
  },
  "ESFJ-O-Virgo": {
    "summary": "You are ESFJ with blood type O and Virgo.",
    "//": 714
  },
  "ESFJ-O-Libra": {
    "summary": "You are ESFJ with blood type O and Libra.",
    "//": 715
  },
  "ESFJ-O-Scorpio": {
    "summary": "You are ESFJ with blood type O and Scorpio.",
    "//": 716
  },
  "ESFJ-O-Sagittarius": {
    "summary": "You are ESFJ with blood type O and Sagittarius.",
    "//": 717
  },
  "ESFJ-O-Capricorn": {
    "summary": "You are ESFJ with blood type O and Capricorn.",
    "//": 718
  },
  "ESFJ-O-Aquarius": {
    "summary": "You are ESFJ with blood type O and Aquarius.",
    "//": 719
  },
  "ESFJ-O-Pisces": {
    "summary": "You are ESFJ with blood type O and Pisces.",
    "//": 720
  },
  "ESFP-A-Aries": {
    "summary": "You are ESFP with blood type A and Aries.",
    "//": 721
  },
  "ESFP-A-Taurus": {
    "summary": "You are ESFP with blood type A and Taurus.",
    "//": 722
  },
  "ESFP-A-Gemini": {
    "summary": "You are ESFP with blood type A and Gemini.",
    "//": 723
  },
  "ESFP-A-Cancer": {
    "summary": "You are ESFP with blood type A and Cancer.",
    "//": 724
  },
  "ESFP-A-Leo": {
    "summary": "You are ESFP with blood type A and Leo.",
    "//": 725
  },
  "ESFP-A-Virgo": {
    "summary": "You are ESFP with blood type A and Virgo.",
    "//": 726
  },
  "ESFP-A-Libra": {
    "summary": "You are ESFP with blood type A and Libra.",
    "//": 727
  },
  "ESFP-A-Scorpio": {
    "summary": "You are ESFP with blood type A and Scorpio.",
    "//": 728
  },
  "ESFP-A-Sagittarius": {
    "summary": "You are ESFP with blood type A and Sagittarius.",
    "//": 729
  },
  "ESFP-A-Capricorn": {
    "summary": "You are ESFP with blood type A and Capricorn.",
    "//": 730
  },
  "ESFP-A-Aquarius": {
    "summary": "You are ESFP with blood type A and Aquarius.",
    "//": 731
  },
  "ESFP-A-Pisces": {
    "summary": "You are ESFP with blood type A and Pisces.",
    "//": 732
  },
  "ESFP-B-Aries": {
    "summary": "You are ESFP with blood type B and Aries.",
    "//": 733
  },
  "ESFP-B-Taurus": {
    "summary": "You are ESFP with blood type B and Taurus.",
    "//": 734
  },
  "ESFP-B-Gemini": {
    "summary": "You are ESFP with blood type B and Gemini.",
    "//": 735
  },
  "ESFP-B-Cancer": {
    "summary": "You are ESFP with blood type B and Cancer.",
    "//": 736
  },
  "ESFP-B-Leo": {
    "summary": "You are ESFP with blood type B and Leo.",
    "//": 737
  },
  "ESFP-B-Virgo": {
    "summary": "You are ESFP with blood type B and Virgo.",
    "//": 738
  },
  "ESFP-B-Libra": {
    "summary": "You are ESFP with blood type B and Libra.",
    "//": 739
  },
  "ESFP-B-Scorpio": {
    "summary": "You are ESFP with blood type B and Scorpio.",
    "//": 740
  },
  "ESFP-B-Sagittarius": {
    "summary": "You are ESFP with blood type B and Sagittarius.",
    "//": 741
  },
  "ESFP-B-Capricorn": {
    "summary": "You are ESFP with blood type B and Capricorn.",
    "//": 742
  },
  "ESFP-B-Aquarius": {
    "summary": "You are ESFP with blood type B and Aquarius.",
    "//": 743
  },
  "ESFP-B-Pisces": {
    "summary": "You are ESFP with blood type B and Pisces.",
    "//": 744
  },
  "ESFP-AB-Aries": {
    "summary": "You are ESFP with blood type AB and Aries.",
    "//": 745
  },
  "ESFP-AB-Taurus": {
    "summary": "You are ESFP with blood type AB and Taurus.",
    "//": 746
  },
  "ESFP-AB-Gemini": {
    "summary": "You are ESFP with blood type AB and Gemini.",
    "//": 747
  },
  "ESFP-AB-Cancer": {
    "summary": "You are ESFP with blood type AB and Cancer.",
    "//": 748
  },
  "ESFP-AB-Leo": {
    "summary": "You are ESFP with blood type AB and Leo.",
    "//": 749
  },
  "ESFP-AB-Virgo": {
    "summary": "You are ESFP with blood type AB and Virgo.",
    "//": 750
  },
  "ESFP-AB-Libra": {
    "summary": "You are ESFP with blood type AB and Libra.",
    "//": 751
  },
  "ESFP-AB-Scorpio": {
    "summary": "You are ESFP with blood type AB and Scorpio.",
    "//": 752
  },
  "ESFP-AB-Sagittarius": {
    "summary": "You are ESFP with blood type AB and Sagittarius.",
    "//": 753
  },
  "ESFP-AB-Capricorn": {
    "summary": "You are ESFP with blood type AB and Capricorn.",
    "//": 754
  },
  "ESFP-AB-Aquarius": {
    "summary": "You are ESFP with blood type AB and Aquarius.",
    "//": 755
  },
  "ESFP-AB-Pisces": {
    "summary": "You are ESFP with blood type AB and Pisces.",
    "//": 756
  },
  "ESFP-O-Aries": {
    "summary": "You are ESFP with blood type O and Aries.",
    "//": 757
  },
  "ESFP-O-Taurus": {
    "summary": "You are ESFP with blood type O and Taurus.",
    "//": 758
  },
  "ESFP-O-Gemini": {
    "summary": "You are ESFP with blood type O and Gemini.",
    "//": 759
  },
  "ESFP-O-Cancer": {
    "summary": "You are ESFP with blood type O and Cancer.",
    "//": 760
  },
  "ESFP-O-Leo": {
    "summary": "You are ESFP with blood type O and Leo.",
    "//": 761
  },
  "ESFP-O-Virgo": {
    "summary": "You are ESFP with blood type O and Virgo.",
    "//": 762
  },
  "ESFP-O-Libra": {
    "summary": "You are ESFP with blood type O and Libra.",
    "//": 763
  },
  "ESFP-O-Scorpio": {
    "summary": "You are ESFP with blood type O and Scorpio.",
    "//": 764
  },
  "ESFP-O-Sagittarius": {
    "summary": "You are ESFP with blood type O and Sagittarius.",
    "//": 765
  },
  "ESFP-O-Capricorn": {
    "summary": "You are ESFP with blood type O and Capricorn.",
    "//": 766
  },
  "ESFP-O-Aquarius": {
    "summary": "You are ESFP with blood type O and Aquarius.",
    "//": 767
  },
  "ESFP-O-Pisces": {
    "summary": "You are ESFP with blood type O and Pisces.",
    "//": 768
  }
}





